Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32CX-BZ3_DFP/1.0.157/BZ3/atdf/PIC32CX5109BZ31048.atdf
<?xml version="1.0"?>
<!--
 Copyright (c) 2021 Microchip Technology Inc.

 SPDX-License-Identifier: Apache-2.0

 Licensed under the Apache License, Version 2.0 (the "License");
 you may not use this file except in compliance with the License.
 You may obtain a copy of the License at

 http://www.apache.org/licenses/LICENSE-2.0

 Unless required by applicable law or agreed to in writing, software
 distributed under the License is distributed on an "AS IS" BASIS,
 WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.
 See the License for the specific language governing permissions and
 limitations under the License.
-->
<avr-tools-device-file xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" schema-version="4.5" xsi:noNamespaceSchemaLocation="../../schema/avr_tools_device_file.xsd">
  <file timestamp="2023-04-11T16:47:11Z"/>
  <variants xmlns:mhc="http://www.atmel.com/schemas/avr-tools-device-file/mhc">
    <variant ordercode="PIC32CX5109BZ31048-I/M" mhc:ordercode="PIC32CX5109BZ31048-I/M" package="QFN48" pinout="QFN48" speedmax="64000000" tempmin="-40" tempmax="105" vccmin="1.90" vccmax="3.60"/>
  </variants>
  <devices>
    <device name="PIC32CX5109BZ31048" architecture="CORTEX-M4" family="PIC32CX" series="PIC32CXBZ31">
      <address-spaces>
        <address-space id="base" name="base" start="0" size="0x100000000" endianness="little">
          <memory-segment name="ROM_SECURE_BOOT_ROM" start="0x0" size="0x10000" type="rom" rw="R" exec="true"/>
          <memory-segment name="ROM_SECURE_BOOT_PATCH" start="0x18000" size="0x00000800" type="rom" rw="R" exec="true"/>
          <memory-segment name="FCR_PFM" start="0x1000000" size="0x80000" type="flash" pagesize="4096" rw="RW" exec="true"/>
          <memory-segment name="FCR_BFM" start="0x800000" size="0x5000" type="flash" pagesize="4096" rw="RW" exec="true"/>
          <memory-segment name="FCR_CFM" start="0x805000" size="0x00001000" type="fuses" pagesize="4096" rw="RW"/>
          <memory-segment name="FCR_OTP_PAGE" start="0x806000" size="0x00001000" type="flash" pagesize="4096" rw="R" exec="true"/>
          <memory-segment name="CMCC_TCM" start="0x2000000" size="0x1000" type="other" rw="RW"/>
          <memory-segment name="RAM_SYSTEM_RAM" start="0x20000000" size="0x18000" type="ram" rw="RW" exec="true"/>
          <memory-segment name="QSPI" start="0x4000000" size="0x1000000" type="other" rw="RW" exec="true" external="true"/>
          <memory-segment name="PBA_BRIDGE" start="0x40000000" size="0x00004000" type="io" rw="RW"/>
          <memory-segment name="PBB_BRIDGE" start="0x41000000" size="0x00017000" type="io" rw="RW"/>
          <memory-segment name="PBC_BRIDGE" start="0x42000000" size="0x00012000" type="io" rw="RW"/>
          <memory-segment name="SILEX_SFR" start="0x43000000" size="0x20000" type="io" rw="RW"/>
          <memory-segment name="PBPIC_BRIDGE" start="0x44000000" size="0x00014000" type="io" rw="RW"/>
          <memory-segment name="MCROM_ROM" start="0x45000000" size="0x2000" type="rom" rw="R" exec="true"/>
          <memory-segment name="SYSTEM_CM4F_SYSTEM_REGISTERS" start="0xE0000000" size="0x1fff4000" type="io" rw="RW"/>
        </address-space>
        <!--
        <address-space id="fuses" name="fuses" start="0x0" size="0x200" endianness="little">
          <memory-segment name="EFUSE" start="0" size="0x200" type="fuses" rw="RW"/>
        </address-space>
		-->
      </address-spaces>
      <parameters>
        <param name="LITTLE_ENDIAN" value="1" caption=""/>
        <param name="NUM_IRQ" value="43" caption=""/>
        <param name="__CM4_REV" value="0x0001" caption=""/>
        <param name="__DEBUG_LVL" value="3" caption=""/>
        <param name="__FPU_PRESENT" value="1" caption=""/>
        <param name="__FRC_DEF_FREQ" value="8000000" caption="FRC Default Frequency"/>
        <param name="__MPU_PRESENT" value="1" caption=""/>
        <param name="__NUM_DMA_CHANNELS" value="16" caption="Number of DMA Channels"/>
        <param name="__NVIC_PRIO_BITS" value="3" caption=""/>
        <param name="__PB1_DEF_FREQ" value="64000000" caption="Peripheral Bus 1 Default Clock Frequency"/>
        <param name="__PB2_DEF_FREQ" value="64000000" caption="Peripheral Bus 2 Default Clock Frequency"/>
        <param name="__PB3_DEF_FREQ" value="64000000" caption="Peripheral Bus 3 Default Clock Frequency"/>
        <param name="__POSC_DEF_FREQ" value="16000000" caption="Primary Oscillator Input Default Frequency"/>
        <param name="__REFCLK1_DEF_FREQ" value="64000000" caption="Reference Clock 1 Default Frequency"/>
        <param name="__REFCLK2_DEF_FREQ" value="64000000" caption="Reference Clock 2 Default Frequency"/>
        <param name="__REFCLK3_DEF_FREQ" value="64000000" caption="Reference Clock 3 Default Frequency"/>
        <param name="__REFCLK4_DEF_FREQ" value="64000000" caption="Reference Clock 4 Default Frequency"/>
        <param name="__REFCLK5_DEF_FREQ" value="64000000" caption="Reference Clock 5 Default Frequency"/>
        <param name="__REFCLK6_DEF_FREQ" value="64000000" caption="Reference Clock 6 Default Frequency"/>
        <param name="__REFCLKI_DEF_FREQ" value="8000000" caption="REFCLKI Pin Input Default Frequency"/>
        <param name="__RFPLL_DEF_FREQ" value="64000000" caption="RFPLL Default Frequency"/>
        <param name="__SOSC_DEF_FREQ" value="32768" caption="Secondary Oscillator Input Default Frequency"/>
        <param name="__SYS_DEF_FREQ" value="64000000" caption="System Clock Default Frequency"/>
        <param name="__TRACE_LVL" value="2" caption=""/>
        <param name="__VENDOR_SYSTICKCONFIG" value="0" caption=""/>
        <param name="__VTOR_PRESENT" value="1" caption=""/>
        <param name="POWER_DOMAIN" value="PD_CORE"/>
        <param name="__BOOT_ROM_HDR_SIZE" value="512" caption="Secure Boot Header"/>
      </parameters>
      <peripherals>
        <module name="AC" id="04704" name2="cmp_ac_u2501_v3" version="A">
          <instance name="AC">
            <register-group name="AC" name-in-module="AC" address-space="base" offset="0x42001C00"/>
            <signals>
              <signal group="AIN" index="0" function="COMPARATOR__ANALOG" pad="PB2"/>
              <signal group="AIN" index="1" function="COMPARATOR__ANALOG" pad="PB3"/>
              <signal group="AIN" index="2" function="COMPARATOR__ANALOG" pad="PB0"/>
              <signal group="AIN" index="3" function="COMPARATOR__ANALOG" pad="PB1"/>
              <signal group="CMP" index="0" function="COMPARATOR__DIGITAL" pad="PA5"/>
              <signal group="CMP" index="1" function="COMPARATOR__DIGITAL" pad="PA13"/>
              <signal group="CMP" index="1" function="COMPARATOR__DIGITAL" pad="PA6"/>
              <signal group="CMPTEN" function="COMPARATOR__DIGITAL" pad="PA6"/>
              <signal group="CMPTOUT" function="COMPARATOR__DIGITAL" pad="PA13"/>
              <signal group="CMPTRDY" function="COMPARATOR__DIGITAL" pad="PA5"/>
            </signals>
            <parameters>
              <param name="INSTANCE_ID" value="71"/>
              <param name="CHIP_AC_PADDR_MSB" value="9"/>
              <param name="CHIP_AC_IMPLEMENTS_VDBLR" value="0"/>
              <param name="CHIP_AC_PAIRS" value="1"/>
              <param name="CHIP_AC_NUM_CMP" value="2"/>
              <param name="CHIP_AC_FUSES_DATA_MSB" value="127"/>
              <param name="CHIP_AC_FUSES_RDY_MSB" value="3"/>
              <param name="CHIP_AC_FUSES_BIAS0_ROWID" value="4"/>
              <param name="CHIP_AC_FUSES_BIAS0_START" value="0"/>
              <param name="CHIP_AC_FUSES_BIAS0_SIZE" value="2"/>
              <param name="GCLK_ID" value="20"/>
              <param name="LOAD_CALIB" value="0"/>
            </parameters>
          </instance>
        </module>
        <module name="ADCHS" id="02508" name2="adc_sar_ctrl_upb_v1" version="A">
          <instance name="ADCHS">
            <register-group name="ADCHS" name-in-module="ADCHS" address-space="base" offset="0x44001400"/>
            <parameters>
              <param name="NUM_INTS" value="2"/>
              <param name="SET_CLR_INV_PRESENT" value="1" caption="Present"/>
              <param name="ADC_EXTERN_ANALOG_IP" value="0" caption="Microchip SARCORE"/>
              <param name="ADC_USE_SYNP_MUX" value="0" caption="Microchip SARCORE"/>
              <param name="ADC_INPUTS_NMBR" value="12" caption="Number of Analog ADC Channels"/>
              <param name="ADC_VREF_STARTUP_TIME" value="50" caption="from Rio-2"/>
              <param name="ADC_CORE_CALIBRATE_TIME" value="81" caption="from Rio-2"/>
              <param name="ADC_CORES_NMBR" value="1" caption="Number of SARCOREs"/>
              <param name="ADC_FCC_NMBR" value="0" caption="No 1st class channels present"/>
              <param name="ADC_ITRIG_NMBR" value="6"/>
              <param name="ADC_UPB_FIFO_PRESENT" value="0" caption="FIFO present"/>
              <param name="ADC_UPB_FIFO_DEPTH" value="0"/>
              <param name="ADC_BVCI_PORT_PRESENT" value="1"/>
              <param name="ADC_BVCI_FIFO_DEPTH" value="16"/>
              <param name="ADC_BVCI_ADDR_WIDTH" value="15"/>
              <param name="ADC_DCMP_NMBR" value="2"/>
              <param name="ADC_FLTR_NMBR" value="2"/>
              <param name="ADC_INTR_NMBR" value="114"/>
              <param name="ADC_EARLY_INTR_PRESENT" value="0" caption="No early interrupts"/>
              <param name="ADC_32BIT_REG_ADDR" value="1" caption="32-bit wide registers"/>
              <param name="ADC_32BIT_OUTPUT_DATA" value="1" caption="32-bit wide register data"/>
              <param name="ADC_CVD_PRESENT" value="1" caption="CVD present"/>
              <param name="AIN_8" value="8" caption="BandGap Reference (internal AN8)"/>
              <param name="AIN_9" value="9" caption="IVref 1.2V (internal AN9)"/>
              <param name="AIN_10" value="10" caption="VBAT/2 (internal AN10)"/>
              <param name="AIN_11" value="11" caption="VDD33/2 (internal AN11)"/>
            </parameters>
            <signals>
              <signal group="ADCSVCLKI" function="SILICON_VALIDATION__DFT_" pad="PA7"/>
              <signal group="ADCSVFRM" function="SILICON_VALIDATION__DFT_" pad="PA9"/>
              <signal group="ADCSVSARCLK" function="SILICON_VALIDATION__DFT_" pad="PA10"/>
              <signal group="ADCSVSOUT" function="SILICON_VALIDATION__DFT_" pad="PB9"/>
              <signal group="ADCSVTRG" function="SILICON_VALIDATION__DFT_" pad="PA8"/>
              <signal group="AIN" index="0" function="ADC" pad="PB4"/>
              <signal group="AIN" index="1" function="ADC" pad="PB5"/>
              <signal group="AIN" index="2" function="ADC" pad="PB6"/>
              <signal group="AIN" index="3" function="ADC" pad="PB7"/>
              <signal group="AIN" index="4" function="ADC" pad="PB0"/>
              <signal group="AIN" index="5" function="ADC" pad="PB1"/>
              <signal group="AIN" index="6" function="ADC" pad="PB2"/>
              <signal group="AIN" index="7" function="ADC" pad="PB3"/>
              <signal group="ANN" index="0" function="ADC__DIFFERENTIAL_" pad="PA3"/>
              <signal group="CVD" index="0" function="ADC" pad="PB4"/>
              <signal group="CVD" index="1" function="ADC" pad="PB5"/>
              <signal group="CVD" index="2" function="ADC" pad="PB6"/>
              <signal group="CVD" index="3" function="ADC" pad="PB7"/>
              <signal group="CVD" index="4" function="ADC" pad="PB0"/>
              <signal group="CVD" index="5" function="ADC" pad="PB1"/>
              <signal group="CVD" index="6" function="ADC" pad="PB2"/>
              <signal group="CVD" index="7" function="ADC" pad="PB3"/>
            </signals>
          </instance>
        </module>
