Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32CX-BZ3_DFP/1.0.157/BZ3/atdf/PIC32CX5109BZ31048.atdf
        <module name="ARB" id="04269" name2="zbt_rad_arb_v1" version="A">
          <instance name="ARB">
            <register-group name="ARB" name-in-module="ARB" address-space="base" offset="0x41011000"/>
          </instance>
        </module>
        <module name="BLE" id="04999" name2="bt_bb_dm_v6" version="A">
          <instance name="BLE">
            <register-group name="BLE" name-in-module="BLE" address-space="base" offset="0x41012000"/>
          </instance>
        </module>
        <module name="BTZBSYS" id="04997" name2="bt_zb_subsys_v2" version="A">
          <instance name="BTZBSYS">
            <register-group name="BTZBSYS" name-in-module="BTZBSYS" address-space="base" offset="0x41014000"/>
            <signals>
              <signal group="AC_CMP1_ALT" function="COMPARATOR__DIGITAL" pad="PA6"/>
              <signal group="CLDO_IN" function="RF__ANALOG" pad="CLDO_IN2"/>
              <signal group="CLDO_IN" function="RF__ANALOG" pad="CLDO_IN_CLKGEN"/>
              <signal group="CLDO_OUT" function="RF__ANALOG" pad="CLDO_OUT_2"/>
              <signal group="CLDO_OUT" function="RF__ANALOG" pad="CLDO_OUT_1"/>
              <signal group="COEXCTRL" index="0" function="RF__DIGITAL" pad="PA13"/>
              <signal group="COEXCTRL" index="1" function="RF__DIGITAL" pad="PA14"/>
              <signal group="COEXCTRL" index="2" function="RF__DIGITAL" pad="PB0"/>
              <signal group="FECTRL" index="0" function="RF__DIGITAL" pad="PA8"/>
              <signal group="FECTRL" index="1" function="RF__DIGITAL" pad="PA9"/>
              <signal group="FECTRL" index="2" function="RF__DIGITAL" pad="PA10"/>
              <signal group="FECTRL" index="3" function="RF__DIGITAL" pad="PB4"/>
              <signal group="FECTRL" index="4" function="RF__DIGITAL" pad="PB5"/>
              <signal group="FECTRL" index="5" function="RF__DIGITAL" pad="PB6"/>
              <signal group="FEM_PD_EXT_PA" function="RF__ANALOG" pad="PB9"/>
              <signal group="MBISTCLK" function="TEST_MODES" pad="PA10"/>
              <signal group="RFLDO_OUT" function="POWER_SUPPLY" pad="RFLDO_OUT"/>
              <signal group="RF_IO" function="RF__ANALOG" pad="RFINOUT_2"/>
              <signal group="RF_IO" function="RF__ANALOG" pad="RFINOUT_1"/>
              <signal group="RTC_IN0_ALT" function="RTCC" pad="PA9"/>
              <signal group="RTC_OUT_ALT" function="RTCC" pad="PA10"/>
              <signal group="TA4D_ALT" function="TEST_MODES" pad="PA6"/>
              <signal group="TP" index="2" function="RF__ANALOG" pad="PB8"/>
              <signal group="TP" index="3" function="RF__ANALOG" pad="PB9"/>
              <signal group="TP" index="4" function="RF__ANALOG" pad="PB4"/>
              <signal group="TP" index="5" function="RF__ANALOG" pad="PB5"/>
              <signal group="TP" index="6" function="RF__ANALOG" pad="PB8"/>
              <signal group="VDD_RF" function="RF__ANALOG" pad="VDD_PLL_LF"/>
              <signal group="VDD_RF" function="RF__ANALOG" pad="VDD_PLL_HF"/>
              <signal group="VDD_RF" function="RF__ANALOG" pad="RFLDO_IN"/>
              <signal group="xo_n" function="RF__ANALOG" pad="XO_N"/>
              <signal group="xo_p" function="RF__ANALOG" pad="XO_P"/>
            </signals>
          </instance>
        </module>
        <module name="CCL" id="04702" name2="cla_ccl_u2225_v3" version="A">
          <instance name="CCL">
            <register-group name="CCL" name-in-module="CCL" address-space="base" offset="0x42001800"/>
            <signals>
              <signal group="IN" index="0" function="1" pad="PA03" ioset="1"/>
              <signal group="IN" index="0" function="2" pad="PA07" ioset="1"/>
              <signal group="IN" index="0" function="3" pad="PA11" ioset="1"/>
              <signal group="IN" index="0" function="4" pad="PB00" ioset="1"/>
              <signal group="IN" index="0" function="5" pad="PB04" ioset="1"/>
              <signal group="IN" index="0" function="6" pad="PB08" ioset="1"/>
              <signal group="IN" index="0" function="7" pad="PB12" ioset="1"/>
              <signal group="IN" index="0" function="8" pad="PA02" ioset="1"/>
              <signal group="IN" index="0" function="9" pad="PA06" ioset="1"/>
              <signal group="IN" index="0" function="10" pad="PA10" ioset="1"/>
              <signal group="IN" index="0" function="11" pad="PA14" ioset="1"/>
              <signal group="IN" index="0" function="12" pad="PB03" ioset="1"/>
              <signal group="IN" index="0" function="13" pad="PB07" ioset="1"/>
              <signal group="IN" index="0" function="14" pad="PB11" ioset="1"/>
              <signal group="IN" index="0" function="15" pad="PA09" ioset="1"/>
              <signal group="IN" index="1" function="1" pad="PA04" ioset="2"/>
              <signal group="IN" index="1" function="2" pad="PA08" ioset="2"/>
              <signal group="IN" index="1" function="3" pad="PA12" ioset="2"/>
              <signal group="IN" index="1" function="4" pad="PB01" ioset="2"/>
              <signal group="IN" index="1" function="5" pad="PB05" ioset="2"/>
              <signal group="IN" index="1" function="6" pad="PB09" ioset="2"/>
              <signal group="IN" index="1" function="7" pad="PB13" ioset="2"/>
              <signal group="IN" index="1" function="8" pad="PA03" ioset="2"/>
              <signal group="IN" index="1" function="9" pad="PA07" ioset="2"/>
              <signal group="IN" index="1" function="10" pad="PA11" ioset="2"/>
              <signal group="IN" index="1" function="11" pad="PB00" ioset="2"/>
              <signal group="IN" index="1" function="12" pad="PB04" ioset="2"/>
              <signal group="IN" index="1" function="13" pad="PB08" ioset="2"/>
              <signal group="IN" index="1" function="14" pad="PB12" ioset="2"/>
              <signal group="IN" index="1" function="15" pad="PA00" ioset="2"/>
              <signal group="IN" index="2" function="1" pad="PA05" ioset="3"/>
              <signal group="IN" index="2" function="2" pad="PA09" ioset="3"/>
              <signal group="IN" index="2" function="3" pad="PA13" ioset="3"/>
              <signal group="IN" index="2" function="4" pad="PB02" ioset="3"/>
              <signal group="IN" index="2" function="5" pad="PB06" ioset="3"/>
              <signal group="IN" index="2" function="6" pad="PB10" ioset="3"/>
              <signal group="IN" index="2" function="7" pad="PA00" ioset="3"/>
              <signal group="IN" index="2" function="8" pad="PA04" ioset="3"/>
              <signal group="IN" index="2" function="9" pad="PA08" ioset="3"/>
              <signal group="IN" index="2" function="10" pad="PA12" ioset="3"/>
              <signal group="IN" index="2" function="11" pad="PB01" ioset="3"/>
              <signal group="IN" index="2" function="12" pad="PB05" ioset="3"/>
              <signal group="IN" index="2" function="13" pad="PB09" ioset="3"/>
              <signal group="IN" index="2" function="14" pad="PB13" ioset="3"/>
              <signal group="IN" index="2" function="15" pad="PA01" ioset="3"/>
              <signal group="IN" index="3" function="1" pad="PA03" ioset="1"/>
              <signal group="IN" index="3" function="2" pad="PA07" ioset="1"/>
              <signal group="IN" index="3" function="3" pad="PA11" ioset="1"/>
              <signal group="IN" index="3" function="4" pad="PB00" ioset="1"/>
              <signal group="IN" index="3" function="5" pad="PB04" ioset="1"/>
              <signal group="IN" index="3" function="6" pad="PB08" ioset="1"/>
              <signal group="IN" index="3" function="7" pad="PB12" ioset="1"/>
              <signal group="IN" index="3" function="8" pad="PA02" ioset="1"/>
              <signal group="IN" index="3" function="9" pad="PA06" ioset="1"/>
              <signal group="IN" index="3" function="10" pad="PA10" ioset="1"/>
              <signal group="IN" index="3" function="11" pad="PA14" ioset="1"/>
              <signal group="IN" index="3" function="12" pad="PB03" ioset="1"/>
              <signal group="IN" index="3" function="13" pad="PB07" ioset="1"/>
              <signal group="IN" index="3" function="14" pad="PB11" ioset="1"/>
              <signal group="IN" index="3" function="15" pad="PA09" ioset="1"/>
              <signal group="IN" index="4" function="1" pad="PA04" ioset="2"/>
              <signal group="IN" index="4" function="2" pad="PA08" ioset="2"/>
              <signal group="IN" index="4" function="3" pad="PA12" ioset="2"/>
              <signal group="IN" index="4" function="4" pad="PB01" ioset="2"/>
              <signal group="IN" index="4" function="5" pad="PB05" ioset="2"/>
              <signal group="IN" index="4" function="6" pad="PB09" ioset="2"/>
              <signal group="IN" index="4" function="7" pad="PB13" ioset="2"/>
              <signal group="IN" index="4" function="8" pad="PA03" ioset="2"/>
              <signal group="IN" index="4" function="9" pad="PA07" ioset="2"/>
              <signal group="IN" index="4" function="10" pad="PA11" ioset="2"/>
              <signal group="IN" index="4" function="11" pad="PB00" ioset="2"/>
              <signal group="IN" index="4" function="12" pad="PB04" ioset="2"/>
              <signal group="IN" index="4" function="13" pad="PB08" ioset="2"/>
              <signal group="IN" index="4" function="14" pad="PB12" ioset="2"/>
              <signal group="IN" index="4" function="15" pad="PA00" ioset="2"/>
              <signal group="IN" index="5" function="1" pad="PA05" ioset="3"/>
              <signal group="IN" index="5" function="2" pad="PA09" ioset="3"/>
              <signal group="IN" index="5" function="3" pad="PA13" ioset="3"/>
              <signal group="IN" index="5" function="4" pad="PB02" ioset="3"/>
              <signal group="IN" index="5" function="5" pad="PB06" ioset="3"/>
              <signal group="IN" index="5" function="6" pad="PB10" ioset="3"/>
              <signal group="IN" index="5" function="7" pad="PA00" ioset="3"/>
              <signal group="IN" index="5" function="8" pad="PA04" ioset="3"/>
              <signal group="IN" index="5" function="9" pad="PA08" ioset="3"/>
              <signal group="IN" index="5" function="10" pad="PA12" ioset="3"/>
              <signal group="IN" index="5" function="11" pad="PB01" ioset="3"/>
              <signal group="IN" index="5" function="12" pad="PB05" ioset="3"/>
              <signal group="IN" index="5" function="13" pad="PB09" ioset="3"/>
              <signal group="IN" index="5" function="14" pad="PB13" ioset="3"/>
              <signal group="IN" index="5" function="15" pad="PA01" ioset="3"/>
              <signal group="OUT" index="0" function="27" pad="PA00" ioset="2"/>
              <signal group="OUT" index="0" function="27" pad="PA03" ioset="2"/>
              <signal group="OUT" index="0" function="27" pad="PA04" ioset="2"/>
              <signal group="OUT" index="0" function="27" pad="PA06" ioset="2"/>
              <signal group="OUT" index="0" function="27" pad="PA07" ioset="2"/>
              <signal group="OUT" index="0" function="27" pad="PA08" ioset="2"/>
              <signal group="OUT" index="0" function="27" pad="PB00" ioset="2"/>
              <signal group="OUT" index="0" function="27" pad="PB01" ioset="2"/>
              <signal group="OUT" index="0" function="27" pad="PB04" ioset="2"/>
              <signal group="OUT" index="0" function="27" pad="PB05" ioset="2"/>
              <signal group="OUT" index="0" function="27" pad="PB08" ioset="2"/>
              <signal group="OUT" index="0" function="27" pad="PB12" ioset="2"/>
              <signal group="OUT" index="0" function="27" pad="PB13" ioset="2"/>
              <signal group="OUT" index="0" function="27" pad="PA00" ioset="3"/>
              <signal group="OUT" index="0" function="27" pad="PA01" ioset="3"/>
              <signal group="OUT" index="0" function="27" pad="PA03" ioset="3"/>
              <signal group="OUT" index="0" function="27" pad="PA04" ioset="3"/>
              <signal group="OUT" index="0" function="27" pad="PA05" ioset="3"/>
              <signal group="OUT" index="0" function="27" pad="PA08" ioset="3"/>
              <signal group="OUT" index="0" function="27" pad="PA09" ioset="3"/>
              <signal group="OUT" index="0" function="27" pad="PA13" ioset="3"/>
              <signal group="OUT" index="0" function="27" pad="PB01" ioset="3"/>
              <signal group="OUT" index="0" function="27" pad="PB02" ioset="3"/>
              <signal group="OUT" index="0" function="27" pad="PB06" ioset="3"/>
              <signal group="OUT" index="0" function="27" pad="PB09" ioset="3"/>
              <signal group="OUT" index="0" function="27" pad="PB10" ioset="3"/>
              <signal group="OUT" index="0" function="27" pad="PB13" ioset="3"/>
              <signal group="OUT" index="1" function="27" pad="PA01" ioset="4"/>
              <signal group="OUT" index="1" function="27" pad="PA02" ioset="4"/>
              <signal group="OUT" index="1" function="27" pad="PA04" ioset="4"/>
              <signal group="OUT" index="1" function="27" pad="PA05" ioset="4"/>
              <signal group="OUT" index="1" function="27" pad="PA06" ioset="4"/>
              <signal group="OUT" index="1" function="27" pad="PA08" ioset="4"/>
              <signal group="OUT" index="1" function="27" pad="PA09" ioset="4"/>
              <signal group="OUT" index="1" function="27" pad="PA10" ioset="4"/>
              <signal group="OUT" index="1" function="27" pad="PA13" ioset="4"/>
              <signal group="OUT" index="1" function="27" pad="PA14" ioset="4"/>
              <signal group="OUT" index="1" function="27" pad="PB02" ioset="4"/>
              <signal group="OUT" index="1" function="27" pad="PB03" ioset="4"/>
              <signal group="OUT" index="1" function="27" pad="PB07" ioset="4"/>
              <signal group="OUT" index="1" function="27" pad="PB10" ioset="4"/>
              <signal group="OUT" index="1" function="27" pad="PB11" ioset="4"/>
            </signals>
            <parameters>
              <param name="INSTANCE_ID" value="70"/>
              <param name="CHIP_CCL_PADDR_MSB" value="9"/>
              <param name="CHIP_CCL_LUT_NUM" value="2"/>
              <param name="GCLK_ID" value="0"/>
            </parameters>
          </instance>
        </module>
