Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32CX-BZ3_DFP/1.0.157/BZ3/atdf/PIC32CX5109BZ31048.atdf
          </instance>
        </module>
        <module name="DSU" id="05006" name2="icd_dsu_u2410_v4" version="A">
          <instance name="DSU">
            <register-group name="DSU" name-in-module="DSU" address-space="base" offset="0x41000000"/>
            <parameters>
              <param name="INSTANCE_ID" value="32"/>
              <param name="PERM_ADDR_START1" value="0x4400_0600" caption="Permissible address range start"/>
              <param name="PERM_ADDR_END1" value="0x4400_07FF" caption="Permissible address range end"/>
              <param name="PERM_ADDR_START2" value="0x4400_2C00" caption="Second permissible address range start"/>
              <param name="PERM_ADDR_END2" value="0x4400_3BFF" caption="Second permissible address range end"/>
              <param name="FLASH_ADDR_START" value="0x0080_0000" caption="Flash address start"/>
              <param name="FLASH_ADDR_END" value="0x0107_FFFF" caption="Flash address end"/>
              <param name="DMAC_ID_DCC0" value="2"/>
              <param name="DMAC_ID_DCC1" value="3"/>
            </parameters>
          </instance>
        </module>
        <module name="DWT" id="SYSTEM_IP" version="1.0.0">
          <instance name="DWT">
            <register-group name="DWT" name-in-module="DWT" address-space="base" offset="0xE0001000"/>
          </instance>
        </module>
        <module name="EIC" id="04714" name2="int_eic_u2254_v4" version="A">
          <instance name="EIC">
            <register-group name="EIC" name-in-module="EIC" address-space="base" offset="0x40000800"/>
            <signals>
              <signal group="EXTINT" index="0" function="1" pad="PA03" ioset="1"/>
              <signal group="EXTINT" index="0" function="2" pad="PA07" ioset="1"/>
              <signal group="EXTINT" index="0" function="3" pad="PA11" ioset="1"/>
              <signal group="EXTINT" index="0" function="4" pad="PB00" ioset="1"/>
              <signal group="EXTINT" index="0" function="5" pad="PB04" ioset="1"/>
              <signal group="EXTINT" index="0" function="6" pad="PB08" ioset="1"/>
              <signal group="EXTINT" index="0" function="7" pad="PB12" ioset="1"/>
              <signal group="EXTINT" index="0" function="8" pad="PA02" ioset="1"/>
              <signal group="EXTINT" index="0" function="9" pad="PA06" ioset="1"/>
              <signal group="EXTINT" index="0" function="10" pad="PA10" ioset="1"/>
              <signal group="EXTINT" index="0" function="11" pad="PA14" ioset="1"/>
              <signal group="EXTINT" index="0" function="12" pad="PB03" ioset="1"/>
              <signal group="EXTINT" index="0" function="13" pad="PB07" ioset="1"/>
              <signal group="EXTINT" index="0" function="14" pad="PB11" ioset="1"/>
              <signal group="EXTINT" index="0" function="15" pad="PA09" ioset="1"/>
              <signal group="EXTINT" index="1" function="1" pad="PA04" ioset="2"/>
              <signal group="EXTINT" index="1" function="2" pad="PA08" ioset="2"/>
              <signal group="EXTINT" index="1" function="3" pad="PA12" ioset="2"/>
              <signal group="EXTINT" index="1" function="4" pad="PB01" ioset="2"/>
              <signal group="EXTINT" index="1" function="5" pad="PB05" ioset="2"/>
              <signal group="EXTINT" index="1" function="6" pad="PB09" ioset="2"/>
              <signal group="EXTINT" index="1" function="7" pad="PB13" ioset="2"/>
              <signal group="EXTINT" index="1" function="8" pad="PA03" ioset="2"/>
              <signal group="EXTINT" index="1" function="9" pad="PA07" ioset="2"/>
              <signal group="EXTINT" index="1" function="10" pad="PA11" ioset="2"/>
              <signal group="EXTINT" index="1" function="11" pad="PB00" ioset="2"/>
              <signal group="EXTINT" index="1" function="12" pad="PB04" ioset="2"/>
              <signal group="EXTINT" index="1" function="13" pad="PB08" ioset="2"/>
              <signal group="EXTINT" index="1" function="14" pad="PB12" ioset="2"/>
              <signal group="EXTINT" index="1" function="15" pad="PA00" ioset="2"/>
              <signal group="EXTINT" index="2" function="1" pad="PA05" ioset="3"/>
              <signal group="EXTINT" index="2" function="2" pad="PA09" ioset="3"/>
              <signal group="EXTINT" index="2" function="3" pad="PA13" ioset="3"/>
              <signal group="EXTINT" index="2" function="4" pad="PB02" ioset="3"/>
              <signal group="EXTINT" index="2" function="5" pad="PB06" ioset="3"/>
              <signal group="EXTINT" index="2" function="6" pad="PB10" ioset="3"/>
              <signal group="EXTINT" index="2" function="7" pad="PA00" ioset="3"/>
              <signal group="EXTINT" index="2" function="8" pad="PA04" ioset="3"/>
              <signal group="EXTINT" index="2" function="9" pad="PA08" ioset="3"/>
              <signal group="EXTINT" index="2" function="10" pad="PA12" ioset="3"/>
              <signal group="EXTINT" index="2" function="11" pad="PB01" ioset="3"/>
              <signal group="EXTINT" index="2" function="12" pad="PB05" ioset="3"/>
              <signal group="EXTINT" index="2" function="13" pad="PB09" ioset="3"/>
              <signal group="EXTINT" index="2" function="14" pad="PB13" ioset="3"/>
              <signal group="EXTINT" index="2" function="15" pad="PA01" ioset="3"/>
              <signal group="EXTINT" index="3" function="1" pad="PA06" ioset="4"/>
              <signal group="EXTINT" index="3" function="2" pad="PA10" ioset="4"/>
              <signal group="EXTINT" index="3" function="3" pad="PA14" ioset="4"/>
              <signal group="EXTINT" index="3" function="4" pad="PB03" ioset="4"/>
              <signal group="EXTINT" index="3" function="5" pad="PB07" ioset="4"/>
              <signal group="EXTINT" index="3" function="6" pad="PB11" ioset="4"/>
              <signal group="EXTINT" index="3" function="7" pad="PA01" ioset="4"/>
              <signal group="EXTINT" index="3" function="8" pad="PA05" ioset="4"/>
              <signal group="EXTINT" index="3" function="9" pad="PA09" ioset="4"/>
              <signal group="EXTINT" index="3" function="10" pad="PA13" ioset="4"/>
              <signal group="EXTINT" index="3" function="11" pad="PB02" ioset="4"/>
              <signal group="EXTINT" index="3" function="12" pad="PB06" ioset="4"/>
              <signal group="EXTINT" index="3" function="13" pad="PB10" ioset="4"/>
              <signal group="EXTINT" index="3" function="14" pad="PA08" ioset="4"/>
              <signal group="EXTINT" index="3" function="15" pad="PA02" ioset="4"/>
              <signal group="NMI" function="1" pad="PA06" ioset="4"/>
              <signal group="NMI" function="2" pad="PA10" ioset="4"/>
              <signal group="NMI" function="3" pad="PA14" ioset="4"/>
              <signal group="NMI" function="4" pad="PB03" ioset="4"/>
              <signal group="NMI" function="5" pad="PB07" ioset="4"/>
              <signal group="NMI" function="6" pad="PB11" ioset="4"/>
              <signal group="NMI" function="7" pad="PA01" ioset="4"/>
              <signal group="NMI" function="8" pad="PA05" ioset="4"/>
              <signal group="NMI" function="9" pad="PA09" ioset="4"/>
              <signal group="NMI" function="10" pad="PA13" ioset="4"/>
              <signal group="NMI" function="11" pad="PB02" ioset="4"/>
              <signal group="NMI" function="12" pad="PB06" ioset="4"/>
              <signal group="NMI" function="13" pad="PB10" ioset="4"/>
              <signal group="NMI" function="14" pad="PA08" ioset="4"/>
              <signal group="NMI" function="15" pad="PA02" ioset="4"/>
            </signals>
            <parameters>
              <param name="INSTANCE_ID" value="2"/>
              <param name="CHIP_EIC_PADDR_MSB" value="9"/>
              <param name="CHIP_EIC_EXTINT_NUM" value="4"/>
              <param name="CHIP_EIC_NMISENSE_DEFAULT_VALUE" value="0"/>
              <param name="CHIP_EIC_NMI_FORCE_DETECTION" value="0"/>
              <param name="CHIP_EIC_NUMBER_OF_CONFIG_REGS" value="1" caption="(CHIP_EIC_EXTINT_NUM+7)/8"/>
              <param name="CHIP_EIC_NUMBER_OF_DPRESCALER_REGS" value="1" caption="(CHIP_EIC_EXTINT_NUM+7)/8"/>
              <param name="CHIP_EIC_NUMBER_OF_INTERRUPTS" value="4" caption="CHIP_EIC_EXTINT_NUM"/>
              <param name="GCLK_ID" value="0"/>
            </parameters>
          </instance>
        </module>
