Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32CX-BZ3_DFP/1.0.157/BZ3/atdf/PIC32CX5109BZ31048.atdf
        <!--
		<module name="EFUSE" id="EIP_00504" version="1.0.0">
		  <instance name="EFUSE">
            <register-group name="EFUSE" name-in-module="EFUSE" address-space="fuses" offset="0x0" />
          </instance>
        </module>
		-->
        <module name="ETM" id="SYSTEM_IP" version="1.0.0">
          <instance name="ETM">
            <register-group name="ETM" name-in-module="ETM" address-space="base" offset="0xE0041000"/>
          </instance>
        </module>
        <module name="EVSYS" id="04712" name2="ptg_evsys_u2504_v3" version="A">
          <instance name="EVSYS">
            <register-group name="EVSYS" name-in-module="EVSYS" address-space="base" offset="0x41006000"/>
            <parameters>
              <param name="INSTANCE_ID" value="35"/>
              <param name="CHIP_EVSYS_PADDR_MSB" value="12"/>
              <param name="CHIP_EVSYS_EXTEVT_NUM" value="0"/>
              <param name="CHIP_EVSYS_ASYNCHRONOUS_CHANNELS" value="0xFFFFF000"/>
              <param name="CHIP_EVSYS_CHANNELS" value="32"/>
              <param name="CHIP_EVSYS_GENERATORS" value="81"/>
              <param name="CHIP_EVSYS_SYNCH_NUM" value="12"/>
              <param name="CHIP_EVSYS_USERS" value="57"/>
              <param name="CHIP_EVSYS_CHANNELS_BITS" value="5"/>
              <param name="CHIP_EVSYS_GENERATORS_BITS" value="7"/>
              <param name="CHIP_EVSYS_SYNCH_NUM_BITS" value="4"/>
              <param name="CHIP_EVSYS_USERS_BITS" value="6"/>
              <param name="GCLK_ID_0" value="8"/>
              <param name="GCLK_ID_1" value="9"/>
              <param name="GCLK_ID_2" value="10"/>
              <param name="GCLK_ID_3" value="11"/>
              <param name="GCLK_ID_4" value="12"/>
              <param name="GCLK_ID_5" value="13"/>
              <param name="GCLK_ID_6" value="14"/>
              <param name="GCLK_ID_7" value="15"/>
              <param name="GCLK_ID_8" value="16"/>
              <param name="GCLK_ID_9" value="17"/>
              <param name="GCLK_ID_10" value="18"/>
              <param name="GCLK_ID_11" value="19"/>
            </parameters>
          </instance>
        </module>
        <module name="FPU" id="SYSTEM_IP" version="1.0.0">
          <instance name="FPU">
            <register-group name="FPU" name-in-module="FPU" address-space="base" offset="0xE000EF30"/>
          </instance>
        </module>
        <module name="FREQM" id="04703" name2="clk_freqm_u2257_v4" version="A">
          <instance name="FREQM">
            <register-group name="FREQM" name-in-module="FREQM" address-space="base" offset="0x40000400"/>
            <parameters>
              <param name="INSTANCE_ID" value="1"/>
              <param name="GCLK_ID_MSR" value="2"/>
              <param name="GCLK_ID_REF" value="1"/>
            </parameters>
          </instance>
        </module>
        <module name="FUSES" id="fuses" name2="fuses" version="A">
          <instance name="FUSES">
            <register-group name="FUSES_DEVICECFG" name-in-module="FUSES_DEVICECFG" address-space="base" offset="0x00805E80"/>
          </instance>
        </module>
        <module name="GPIO" id="02467" name2="gpio_ports_upb_v1" version="A">
          <instance name="GPIOA">
            <register-group name="GPIOA" name-in-module="GPIO" address-space="base" offset="0x44002A00"/>
            <signals>
              <signal group="IOCA" index="0" function="CHANGE_NOTIFICATION" pad="PA0"/>
              <signal group="IOCA" index="1" function="CHANGE_NOTIFICATION" pad="PA1"/>
              <signal group="IOCA" index="2" function="CHANGE_NOTIFICATION" pad="PA2"/>
              <signal group="IOCA" index="3" function="CHANGE_NOTIFICATION" pad="PA3"/>
              <signal group="IOCA" index="4" function="CHANGE_NOTIFICATION" pad="PA4"/>
              <signal group="IOCA" index="5" function="CHANGE_NOTIFICATION" pad="PA5"/>
              <signal group="IOCA" index="6" function="CHANGE_NOTIFICATION" pad="PA6"/>
              <signal group="IOCA" index="7" function="CHANGE_NOTIFICATION" pad="PA7"/>
              <signal group="IOCA" index="8" function="CHANGE_NOTIFICATION" pad="PA8"/>
              <signal group="IOCA" index="9" function="CHANGE_NOTIFICATION" pad="PA9"/>
              <signal group="IOCA" index="10" function="CHANGE_NOTIFICATION" pad="PA10"/>
              <signal group="IOCA" index="13" function="CHANGE_NOTIFICATION" pad="PA13"/>
              <signal group="IOCA" index="14" function="CHANGE_NOTIFICATION" pad="PA14"/>
              <signal group="RA" index="0" function="PORT_I_O" pad="PA0"/>
              <signal group="RA" index="1" function="PORT_I_O" pad="PA1"/>
              <signal group="RA" index="2" function="PORT_I_O" pad="PA2"/>
              <signal group="RA" index="3" function="PORT_I_O" pad="PA3"/>
              <signal group="RA" index="4" function="PORT_I_O" pad="PA4"/>
              <signal group="RA" index="5" function="PORT_I_O" pad="PA5"/>
              <signal group="RA" index="6" function="PORT_I_O" pad="PA6"/>
              <signal group="RA" index="7" function="PORT_I_O" pad="PA7"/>
              <signal group="RA" index="8" function="PORT_I_O" pad="PA8"/>
              <signal group="RA" index="9" function="PORT_I_O" pad="PA9"/>
              <signal group="RA" index="10" function="PORT_I_O" pad="PA10"/>
              <signal group="RA" index="13" function="PORT_I_O" pad="PA13"/>
              <signal group="RA" index="14" function="PORT_I_O" pad="PA14"/>
            </signals>
          </instance>
          <instance name="GPIOB">
            <register-group name="GPIOB" name-in-module="GPIO" address-space="base" offset="0x44002B00"/>
            <signals>
              <signal group="IOCB" index="0" function="CHANGE_NOTIFICATION" pad="PB0"/>
              <signal group="IOCB" index="1" function="CHANGE_NOTIFICATION" pad="PB1"/>
              <signal group="IOCB" index="2" function="CHANGE_NOTIFICATION" pad="PB2"/>
              <signal group="IOCB" index="3" function="CHANGE_NOTIFICATION" pad="PB3"/>
              <signal group="IOCB" index="4" function="CHANGE_NOTIFICATION" pad="PB4"/>
              <signal group="IOCB" index="5" function="CHANGE_NOTIFICATION" pad="PB5"/>
              <signal group="IOCB" index="6" function="CHANGE_NOTIFICATION" pad="PB6"/>
              <signal group="IOCB" index="7" function="CHANGE_NOTIFICATION" pad="PB7"/>
              <signal group="IOCB" index="8" function="CHANGE_NOTIFICATION" pad="PB8"/>
              <signal group="IOCB" index="9" function="CHANGE_NOTIFICATION" pad="PB9"/>
              <signal group="IOCB" index="10" function="CHANGE_NOTIFICATION" pad="PB10"/>
              <signal group="IOCB" index="11" function="CHANGE_NOTIFICATION" pad="PB11"/>
              <signal group="IOCB" index="12" function="CHANGE_NOTIFICATION" pad="PB12"/>
              <signal group="IOCB" index="13" function="CHANGE_NOTIFICATION" pad="PB13"/>
              <signal group="RB" index="0" function="PORT_I_O" pad="PB0"/>
              <signal group="RB" index="1" function="PORT_I_O" pad="PB1"/>
              <signal group="RB" index="2" function="PORT_I_O" pad="PB2"/>
              <signal group="RB" index="3" function="PORT_I_O" pad="PB3"/>
              <signal group="RB" index="4" function="PORT_I_O" pad="PB4"/>
              <signal group="RB" index="5" function="PORT_I_O" pad="PB5"/>
              <signal group="RB" index="6" function="PORT_I_O" pad="PB6"/>
              <signal group="RB" index="7" function="PORT_I_O" pad="PB7"/>
              <signal group="RB" index="8" function="PORT_I_O" pad="PB8"/>
              <signal group="RB" index="9" function="PORT_I_O" pad="PB9"/>
              <signal group="RB" index="10" function="PORT_I_O" pad="PB10"/>
              <signal group="RB" index="11" function="PORT_I_O" pad="PB11"/>
              <signal group="RB" index="12" function="PORT_I_O" pad="PB12"/>
              <signal group="RB" index="13" function="PORT_I_O" pad="PB13"/>
            </signals>
          </instance>
        </module>
