Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32CX-BZ3_DFP/1.0.157/BZ3/atdf/PIC32CX5109BZ31048.atdf
        <module name="PCHE" id="03088" name2="pfm_cache_ocp_v2" version="A">
          <instance name="PCHE">
            <register-group name="PCHE" name-in-module="PCHE" address-space="base" offset="0x44012400"/>
            <parameters>
              <param name="UPB_ADDRL" value="0x2400"/>
              <param name="NUM_INTS" value="1" caption="ECC present"/>
              <param name="PFM_ECC_PRESENT" value="1" caption="ECC present"/>
              <param name="DCHE_PRIORITY" value="0" caption="dCache has equal priority with iCache and aCache"/>
              <param name="CHE_TAG_MASK" value="0xFD00_000F"/>
              <param name="PFM_RDATA_MSB" value="255" caption="bit flash data and 16-byte cache lines"/>
              <param name="NUM_CL_I" value="4"/>
              <param name="NUM_CL_D" value="2"/>
              <param name="NUM_CL_A" value="2"/>
              <param name="FLOP_BASED_CACHE_ARRAY_I" value="1" caption="Subject to Change / Design Legwork is needed"/>
              <param name="FLOP_BASED_CACHE_ARRAY_D" value="1" caption="Subject to Change / Design Legwork is needed"/>
              <param name="FLOP_BASED_CACHE_ARRAY_A" value="1" caption="Subject to Change / Design Legwork is needed"/>
            </parameters>
          </instance>
        </module>
        <module name="PFW" id="03141" name2="pfm_wrap_32bit_upb_v4" version="A">
          <instance name="PFW">
            <register-group name="PFW" name-in-module="PFW" address-space="base" offset="0x44000800"/>
            <parameters>
              <param name="BOOT_ADDR_BASE" value="0x0000_0000" caption="Physical Start address of boot flash memory (system address). Address must be aligned to the NVR size."/>
              <param name="FIXED_BOOT_SEL_BIT" value="18" caption="The highest bit position that allows address decode to differentiate between fixed and aliased NVR address space. When set, this bit will select fixed NVR space."/>
              <param name="NVR_PANEL_SEL_BIT" value="16" caption="The highest bit position that allows address decode to differentiate between NVR address space in Panel 1 and Panel 2  (if supported). Note: the value for NVR_PANEL_SEL_BIT will typically be FIXED_BOOT_SEL_BIT-1This parameter is not applicable for Buckland as there is only a single panel"/>
              <param name="PFM_PNL_ADDR_MSB" value="18" caption="The MSb of the PFM Panel Byte Address.For example, an 18 indicates that each PFM panel is 512KBbecause 2(18+1)=512K."/>
              <param name="PAGE_ADDR_MSB" value="11" caption="The MSb of the Address bit that defines the page size"/>
              <param name="FLASH_SIZE_ON_DEVICE" value="6" caption="Flash size implemented on the device:In a dual panel system, half this value is the size of each panel.0000 = 8KB0001 = 16KB0010 = 32KB0011 = 64KB0100 = 128KB0101 = 256KB'\\0110 = 512KB0111 = 1MB1000 = 2MB1001 = 4MB1010 = 8MB1011 = 16MB1100 - 1111 = RSVD - use 16MBNote: This values does not include the size of the NVR region."/>
              <param name="PFM_NUM_PANELS" value="1" caption="Number of Flash panels supported in device"/>
              <param name="RR_NUM_RECORDS" value="2" caption="Number of Redundancy Records per Panel. Redundancy Records are 16-bit values. Panels usually have 1 Redundant Page per 512KB.Note: Valid values are 1,2,4,8,16,32."/>
              <param name="NVR_NUM_PAGES" value="8" caption="Number of Pages in the NVR regionThe following values must be supported: 8, 24"/>
              <param name="PFM_PNL_DATA_MSB" value="139" caption="The MSb of the data including ECCThe following values are supported.139,271 if PFM_ECC_PRESENT==1127,255 if PFM_ECC_PRESENT==0"/>
              <param name="PFM_DATA_MSB" value="127" caption="The MSb of the PFM Data (post ECC if implement).The following values are supported.127,255"/>
              <param name="PFM_ECC_PRESENT" value="1" caption="0: ECC not supported1: ECC supported"/>
              <param name="PFM_CRC_PRESENT" value="1" caption="0: CRC not supported1: CRC supported"/>
              <param name="FRC_PERIOD_MIN" value="95" caption="Minimum FRC period (ns) - pre-calibration Power up timing must be met using an uncalibrated FRCNote: This number must be adjusted for the accuracy of the FRC."/>
              <param name="FRC_PERIOD_NOM" value="119" caption="Nominal FRC period (ns) - post-calibration DPD, Read Mode, etc timing uses a calibrated FRC.Note: This number must be adjusted for the accuracy of the FRC."/>
              <param name="PFM_TDPDH_NS" value="5000" caption="DPD recovery (Tdpdh) delay spec (ns)"/>
              <param name="PFM_TDPDS_NS" value="100" caption="DPD Setup (Tdpds) delay spec (ns)"/>
              <param name="PFM_TMS_NS" value="5000" caption="Read Mode Setup (Tcrs or Tms) delay spec (ns)"/>
              <param name="PFM_TMH_NS" value="15" caption="Read Mode Hold (Tcrh or Tmh) delay spec (ns)"/>
              <param name="PFM_TRT_NS" value="1000" caption="PORb Release Time (Trt) delay spec (ns):defined from rst_reset_por_n=1 to PORb=1"/>
              <param name="PFM_TRHR_NS" value="7000" caption="POR recovery (Trhr) delay spec (ns)"/>
              <param name="PFM_TONWAIT_NS" value="6000" caption="Power-up to any operation (ns): aka tONWAITUsed with tCFG as follows:Actual Delay Required = tONWAIT - tCFG"/>
              <param name="PFM_TCFG_NS" value="1000" caption="LKCFG hold (Tcfg) spec (ns): aka tCFGPORb High to LKCFG high"/>
              <param name="NUM_INTS" value="1" caption="Number of interrupts generated by this macro."/>
              <param name="UPB_ADDRL" value="8000" caption="This parameter is the lowest peripheral bus address the peripheral module owns (i.e., the base address)"/>
              <param name="UPB_DEFAULT_SPACING" value="0x0004"/>
            </parameters>
          </instance>
        </module>
        <module name="PMU" id="04856" name2="pmu_ctrl_pb_v3" version="A">
          <instance name="PMU">
            <register-group name="PMU" name-in-module="PMU" address-space="base" offset="0x44013E00"/>
            <signals>
              <signal group="INT" index="0" function="EDGE_INTERRUPT" pad="PB9"/>
              <signal group="PMU_RDY_OVERRIDE" function="RF__DIGITAL" pad="PMU_RDY_OVERRIDE"/>
              <signal group="PMU_TEST_CS" function="RF__DIGITAL" pad="PA9"/>
              <signal group="PMU_TEST_SCK" function="RF__DIGITAL" pad="PA7"/>
              <signal group="PMU_TEST_SCKO" function="RF__DIGITAL" pad="PB8"/>
              <signal group="PMU_TEST_SDI" function="RF__DIGITAL" pad="PA8"/>
              <signal group="PMU_TEST_SDO" function="RF__DIGITAL" pad="PA10"/>
              <signal group="pmu_bk_lx" function="RF__ANALOG" pad="PMU_BK_LX1"/>
              <signal group="pmu_bk_lx" function="RF__ANALOG" pad="PMU_BK_LX2"/>
              <signal group="pmu_mldo_buck_vsense" function="RF__ANALOG" pad="PMU_MLDO_BUCK_VSENSE"/>
              <signal group="pmu_mldo_out" function="RF__ANALOG" pad="PMU_MLDO_OUT2"/>
              <signal group="pmu_mldo_out" function="RF__ANALOG" pad="PMU_MLDO_OUT1"/>
              <signal group="pmu_sub" function="RF__ANALOG" pad="PMU_SUB"/>
            </signals>
            <parameters>
              <param name="SPI_ADDR_WIDTH" value="8"/>
              <param name="SPI_DATA_WIDTH" value="16"/>
              <param name="SPI_DRIVING" value="0" caption="Falling Edge (Rising Edge / Falling Edge)"/>
              <param name="SPI_SAMPLING" value="0" caption="Falling Edge (Rising Edge / Falling Edge)"/>
              <param name="NO_OF_BUCK_SQEQ_REGS" value="3" caption="Register values to be taken from Analog Design team"/>
              <param name="RST_CYCLES" value="8" caption="Duration of SPI Soft Reset in terms of number of SPI Clock Cycles"/>
              <param name="SPI_CTRL_STARTUP_VAL" value="4" caption="spi_cs_n_mv, spi_clk_mv, spi_dout_mv"/>
              <param name="LDO_STARTUP_VAL" value="1" caption="Definition and usage refer to Section 4.4"/>
              <param name="MLDO_OPER_VAL" value="3" caption="buck_en_mv, mldo_en_mv, buck_mode_mv"/>
              <param name="BUCK_OPER_VAL" value="5" caption="{buck_en_mv, mldo_en_mv, buck_mode_mv}"/>
              <param name="SW_VAL" value="7" caption="{buck_en_mv, mldo_en_mv, buck_mode_mv}"/>
              <param name="WCM_SIZE" value="8"/>
              <param name="WCM_TRANSITION_TIME" value="4" caption="nsbased on feedback from ARM and Design team"/>
              <param name="WCM_RET1N_TIME" value="4" caption="ns based on feedback from  ARM and Design team"/>
              <param name="BUCK_SEQ_RETRY_NUM" value="10"/>
              <param name="NUM_LDO" value="1" caption="Number of LDOs (4 on Rio)"/>
              <param name="WLDO_NUM" value="3" caption="NA if &gt; NUM_LDOS"/>
              <param name="SHARED_LDO_MODE" value="1" caption="WCM memory Core does not use separate LDO in run and in retention mode"/>
              <param name="VBC_INDIRECT_MODE" value="1" caption="New"/>
            </parameters>
          </instance>
        </module>
        <module name="PPS" id="pps_pb_v1" name2="pps_pb_v1" version="A">
          <instance name="PPS">
            <register-group name="PPS" name-in-module="PPS" address-space="base" offset="0x44001000"/>
            <signals>
              <signal group="RPA" index="0" function="PPS" pad="PA0"/>
              <signal group="RPA" index="1" function="PPS" pad="PA1"/>
              <signal group="RPA" index="2" function="PPS" pad="PA2"/>
              <signal group="RPA" index="3" function="PPS" pad="PA3"/>
              <signal group="RPA" index="4" function="PPS" pad="PA4"/>
              <signal group="RPA" index="5" function="PPS" pad="PA5"/>
              <signal group="RPA" index="6" function="PPS" pad="PA6"/>
              <signal group="RPA" index="7" function="PPS" pad="PA7"/>
              <signal group="RPA" index="8" function="PPS" pad="PA8"/>
              <signal group="RPA" index="9" function="PPS" pad="PA9"/>
              <signal group="RPA" index="10" function="PPS" pad="PA10"/>
              <signal group="RPA" index="13" function="PPS" pad="PA13"/>
              <signal group="RPA" index="14" function="PPS" pad="PA14"/>
              <signal group="RPB" index="0" function="PPS" pad="PB0"/>
              <signal group="RPB" index="1" function="PPS" pad="PB1"/>
              <signal group="RPB" index="2" function="PPS" pad="PB2"/>
              <signal group="RPB" index="3" function="PPS" pad="PB3"/>
              <signal group="RPB" index="4" function="PPS" pad="PB4"/>
              <signal group="RPB" index="5" function="PPS" pad="PB5"/>
              <signal group="RPB" index="6" function="PPS" pad="PB6"/>
              <signal group="RPB" index="7" function="PPS" pad="PB7"/>
              <signal group="RPB" index="8" function="PPS" pad="PB8"/>
              <signal group="RPB" index="9" function="PPS" pad="PB9"/>
              <signal group="RPB" index="10" function="PPS" pad="PB10"/>
              <signal group="RPB" index="11" function="PPS" pad="PB11"/>
              <signal group="RPB" index="12" function="PPS" pad="PB12"/>
              <signal group="RPB" index="13" function="PPS" pad="PB13"/>
            </signals>
            <parameters>
              <param name="PB_ADDRL" value="0x1000"/>
              <param name="PB_ADDRH" value="0x13FF"/>
            </parameters>
          </instance>
        </module>
