Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32CX-BZ3_DFP/1.0.157/BZ3/atdf/PIC32CX5109BZ31048.atdf
        <module name="QSPI" id="04708" name2="com_qspi_u2008_v2" version="A">
          <instance name="QSPI">
            <register-group name="QSPI" name-in-module="QSPI" address-space="base" offset="0x42000000"/>
            <signals>
              <signal group="CS" function="SQI" pad="PB13"/>
              <signal group="DATA" index="0" function="SQI" pad="PA0"/>
              <signal group="DATA" index="1" function="SQI" pad="PB12"/>
              <signal group="DATA" index="2" function="SQI" pad="PB11"/>
              <signal group="DATA" index="3" function="SQI" pad="PA2"/>
              <signal group="SCK" function="SQI" pad="PA1"/>
            </signals>
            <parameters>
              <param name="INSTANCE_ID" value="64"/>
              <param name="DMAC_ID_RX" value="51"/>
              <param name="DMAC_ID_TX" value="52"/>
            </parameters>
          </instance>
        </module>
        <module name="RAMECC" id="04713" name2="ram_ramecc_u2268_v2" version="A">
          <instance name="RAMECC">
            <register-group name="RAMECC" name-in-module="RAMECC" address-space="base" offset="0x41008000"/>
            <parameters>
              <param name="INSTANCE_ID" value="36"/>
            </parameters>
          </instance>
        </module>
        <module name="RCON" id="03100" name2="clk_cru_upb_v3" version="A">
          <instance name="RCON">
            <register-group name="RCON" name-in-module="RCON" address-space="base" offset="0x44000A00"/>
          </instance>
        </module>
        <module name="ROT" id="04599" name2="sec_root_of_trust_v1" version="Rev A.1">
          <instance name="ROT">
            <register-group name="ROT" name-in-module="ROT" address-space="base" offset="0x44002C00"/>
            <parameters>
              <param name="ROM_SIZE" value="64"/>
              <param name="NUM_FUSE_BLKS" value="3" caption="CAL bits and die info a part of the NVR region"/>
              <param name="CAL_NUM" value="0"/>
              <param name="SYMMETRIC_SECURE_BOOT" value="0" caption="Secure boot using ECCDSA authentication"/>
            </parameters>
          </instance>
        </module>
        <module name="RTC" id="U2250" name2="tmr_rtc_u2250_v4" version="A">
          <instance name="RTC">
            <register-group name="RTC" name-in-module="RTC" address-space="base" offset="0x42010000"/>
            <signals>
              <signal group="EVENT" function="RTCC" pad="PB13"/>
              <signal group="IN" index="0" function="RTCC" pad="PA3"/>
              <signal group="IN" index="1" function="RTCC" pad="PA2"/>
              <signal group="IN" index="2" function="RTCC" pad="PA1"/>
              <signal group="IN" index="3" function="RTCC" pad="PA0"/>
              <signal group="IN0_ALT" function="RTCC" pad="PA9"/>
              <signal group="OUT" function="RTCC" pad="PA4"/>
              <signal group="OUT_ALT" function="RTCC" pad="PA10"/>
            </signals>
            <parameters>
              <param name="CHIP_RTC_PADDR_MSB" value="9"/>
              <param name="CHIP_RTC_NUM_OF_ALARMS" value="2"/>
              <param name="CHIP_RTC_NUM_OF_BKREGS" value="1"/>
              <param name="CHIP_RTC_NUM_OF_COMP16" value="4"/>
              <param name="CHIP_RTC_NUM_OF_TAMPERS" value="4"/>
              <param name="DMAC_ID_TIMESTAMP" value="1"/>
            </parameters>
          </instance>
        </module>
        <module name="SERCOM" id="04707" name2="com_sercom_u2201_v7" version="A">
          <instance name="SERCOM0">
            <register-group name="SERCOM0" name-in-module="SERCOM" address-space="base" offset="0x40000C00"/>
            <signals>
              <signal group="PAD" index="0" function="MSSP_SPI_I2C" pad="PA5"/>
              <signal group="PAD" index="1" function="MSSP_SPI_I2C" pad="PA6"/>
              <signal group="PAD" index="2" function="MSSP_SPI_I2C" pad="PB9"/>
              <signal group="PAD" index="3" function="MSSP_SPI_I2C" pad="PA4"/>
            </signals>
            <parameters>
              <param name="INSTANCE_ID" value="3"/>
              <param name="DMAC_ID_RX" value="4"/>
              <param name="DMAC_ID_TX" value="5"/>
              <param name="GCLK_ID_SLOW" value="3"/>
              <param name="GCLK_ID_CORE" value="3"/>
            </parameters>
          </instance>
          <instance name="SERCOM1">
            <register-group name="SERCOM1" name-in-module="SERCOM" address-space="base" offset="0x40001000"/>
            <signals>
              <signal group="PAD" index="0" function="MSSP_SPI_I2C" pad="PA7"/>
              <signal group="PAD" index="1" function="MSSP_SPI_I2C" pad="PA8"/>
              <signal group="PAD" index="2" function="MSSP_SPI_I2C" pad="PA9"/>
              <signal group="PAD" index="3" function="MSSP_SPI_I2C" pad="PA10"/>
            </signals>
            <parameters>
              <param name="INSTANCE_ID" value="4"/>
              <param name="DMAC_ID_RX" value="6"/>
              <param name="DMAC_ID_TX" value="7"/>
              <param name="GCLK_ID_SLOW" value="3"/>
              <param name="GCLK_ID_CORE" value="3"/>
            </parameters>
          </instance>
          <instance name="SERCOM2">
            <register-group name="SERCOM2" name-in-module="SERCOM" address-space="base" offset="0x42000400"/>
            <signals>
              <signal group="I2C_SERCOM_PAD" index="0" function="I2C" pad="PA13"/>
              <signal group="I2C_SERCOM_PAD" index="1" function="I2C" pad="PA14"/>
            </signals>
            <parameters>
              <param name="SPI" value="0"/>
              <param name="USART" value="0"/>
              <param name="INSTANCE_ID" value="65"/>
              <param name="CHIP_SERCOM_PADDR_MSB" value="31"/>
              <param name="CHIP_SERCOM_CLK_REDUCTION" value="1"/>
              <param name="CHIP_SERCOM_DMA" value="1"/>
              <param name="CHIP_SERCOM_FIFO_DEPTH_POWER" value="1"/>
              <param name="CHIP_SERCOM_RETENTION_SUPPORT" value="0"/>
              <param name="CHIP_SERCOM_SPI" value="0"/>
              <param name="CHIP_SERCOM_SPI_HW_SS_CTRL" value="0"/>
              <param name="CHIP_SERCOM_SPI_ICSPACE_EXT" value="0"/>
              <param name="CHIP_SERCOM_SPI_OZMO" value="0"/>
              <param name="CHIP_SERCOM_SPI_WAKE_ON_SSL" value="0"/>
              <param name="CHIP_SERCOM_TTBIT_EXTENSION" value="1"/>
              <param name="CHIP_SERCOM_TWIM" value="1"/>
              <param name="CHIP_SERCOM_TWIS" value="1"/>
              <param name="CHIP_SERCOM_TWIS_AUTO_ACK" value="1"/>
              <param name="CHIP_SERCOM_TWIS_GROUP_CMD" value="1"/>
              <param name="CHIP_SERCOM_TWIS_SDASETUP_CNT_SIZE" value="8"/>
              <param name="CHIP_SERCOM_TWIS_SDASETUP_SIZE" value="4"/>
              <param name="CHIP_SERCOM_TWIS_SUDAT" value="1"/>
              <param name="CHIP_SERCOM_TWI_FASTMP" value="1"/>
              <param name="CHIP_SERCOM_TWI_HSMODE" value="1"/>
              <param name="CHIP_SERCOM_TWI_SCLSM_MODE" value="1"/>
              <param name="CHIP_SERCOM_TWI_SMB_TIMEOUTS" value="1"/>
              <param name="CHIP_SERCOM_TWI_TENBIT_ADR" value="1"/>
              <param name="CHIP_SERCOM_USART" value="0"/>
              <param name="CHIP_SERCOM_USART_AUTOBAUD" value="0"/>
              <param name="CHIP_SERCOM_USART_COLDET" value="0"/>
              <param name="CHIP_SERCOM_USART_FLOW_CTRL" value="0"/>
              <param name="CHIP_SERCOM_USART_FRAC_BAUD" value="0"/>
              <param name="CHIP_SERCOM_USART_IRDA" value="0"/>
              <param name="CHIP_SERCOM_USART_ISO7816" value="0"/>
              <param name="CHIP_SERCOM_USART_LIN_MASTER" value="0"/>
              <param name="CHIP_SERCOM_USART_RS485" value="0"/>
              <param name="CHIP_SERCOM_USART_SAMPA_EXT" value="0"/>
              <param name="CHIP_SERCOM_USART_SAMPR_EXT" value="0"/>
              <param name="CHIP_SERCOM_DLY_COMPENSATION" value="1"/>
              <param name="CHIP_SERCOM_SE_CNT" value="1"/>
              <param name="DMAC_ID_RX" value="8"/>
              <param name="DMAC_ID_TX" value="9"/>
              <param name="GCLK_ID_SLOW" value="4"/>
              <param name="GCLK_ID_CORE" value="4"/>
            </parameters>
          </instance>
        </module>
