Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32CX-BZ3_DFP/1.0.157/BZ3/atdf/PIC32CX5109BZ31048.atdf
        <module name="SILEX" id="00585" name2="barco_silex_ba457" version="1.0.0">
          <instance name="SILEX">
            <register-group name="SILEX" name-in-module="SILEX" address-space="base" offset="0x43000000"/>
          </instance>
        </module>
        <module name="SysTick" id="SYSTEM_IP" version="1.0.0">
          <instance name="SysTick">
            <register-group name="SysTick" name-in-module="SysTick" address-space="base" offset="0xE000E010"/>
          </instance>
        </module>
        <module name="SystemControl" id="SYSTEM_IP" version="1.0.0">
          <instance name="SystemControl">
            <register-group name="SystemControl" name-in-module="SystemControl" address-space="base" offset="0xE000E000"/>
          </instance>
        </module>
        <module name="TC" id="04705" name2="tmr_tc_u2249_v5" version="A">
          <instance name="TC0">
            <register-group name="TC0" name-in-module="TC" address-space="base" offset="0x40001400"/>
            <parameters>
              <param name="INSTANCE_ID" value="5"/>
              <param name="DMAC_ID_OVF" value="27"/>
              <param name="DMAC_ID_MC0" value="28"/>
              <param name="DMAC_ID_MC1" value="29"/>
              <param name="MASTER_SLAVE_MODE" value="1"/>
              <param name="GCLK_ID" value="24"/>
            </parameters>
          </instance>
          <instance name="TC1">
            <register-group name="TC1" name-in-module="TC" address-space="base" offset="0x40001800"/>
            <parameters>
              <param name="INSTANCE_ID" value="6"/>
              <param name="DMAC_ID_OVF" value="30"/>
              <param name="DMAC_ID_MC0" value="31"/>
              <param name="DMAC_ID_MC1" value="32"/>
              <param name="MASTER_SLAVE_MODE" value="2"/>
              <param name="GCLK_ID" value="25"/>
            </parameters>
          </instance>
          <instance name="TC2">
            <register-group name="TC2" name-in-module="TC" address-space="base" offset="0x40001C00"/>
            <parameters>
              <param name="INSTANCE_ID" value="7"/>
              <param name="DMAC_ID_OVF" value="33"/>
              <param name="DMAC_ID_MC0" value="34"/>
              <param name="DMAC_ID_MC1" value="35"/>
              <param name="MASTER_SLAVE_MODE" value="1"/>
              <param name="GCLK_ID" value="26"/>
            </parameters>
          </instance>
          <instance name="TC3">
            <register-group name="TC3" name-in-module="TC" address-space="base" offset="0x40002000"/>
            <parameters>
              <param name="INSTANCE_ID" value="8"/>
              <param name="DMAC_ID_OVF" value="36"/>
              <param name="DMAC_ID_MC0" value="37"/>
              <param name="DMAC_ID_MC1" value="38"/>
              <param name="MASTER_SLAVE_MODE" value="2"/>
              <param name="GCLK_ID" value="26"/>
            </parameters>
          </instance>
          <instance name="TC4">
            <register-group name="TC4" name-in-module="TC" address-space="base" offset="0x40002400"/>
            <parameters>
              <param name="INSTANCE_ID" value="9"/>
              <param name="DMAC_ID_OVF" value="39"/>
              <param name="DMAC_ID_MC0" value="40"/>
              <param name="DMAC_ID_MC1" value="41"/>
              <param name="MASTER_SLAVE_MODE" value="1"/>
              <param name="GCLK_ID" value="27"/>
            </parameters>
          </instance>
          <instance name="TC5">
            <register-group name="TC5" name-in-module="TC" address-space="base" offset="0x40002800"/>
            <parameters>
              <param name="INSTANCE_ID" value="10"/>
              <param name="DMAC_ID_OVF" value="42"/>
              <param name="DMAC_ID_MC0" value="43"/>
              <param name="DMAC_ID_MC1" value="44"/>
              <param name="MASTER_SLAVE_MODE" value="2"/>
              <param name="GCLK_ID" value="27"/>
            </parameters>
          </instance>
          <instance name="TC6">
            <register-group name="TC6" name-in-module="TC" address-space="base" offset="0x40002C00"/>
            <parameters>
              <param name="INSTANCE_ID" value="11"/>
              <param name="DMAC_ID_OVF" value="45"/>
              <param name="DMAC_ID_MC0" value="46"/>
              <param name="DMAC_ID_MC1" value="47"/>
              <param name="MASTER_SLAVE_MODE" value="1"/>
              <param name="GCLK_ID" value="28"/>
            </parameters>
          </instance>
          <instance name="TC7">
            <register-group name="TC7" name-in-module="TC" address-space="base" offset="0x40003000"/>
            <parameters>
              <param name="INSTANCE_ID" value="12"/>
              <param name="DMAC_ID_OVF" value="48"/>
              <param name="DMAC_ID_MC0" value="49"/>
              <param name="DMAC_ID_MC1" value="50"/>
              <param name="MASTER_SLAVE_MODE" value="2"/>
              <param name="GCLK_ID" value="28"/>
            </parameters>
          </instance>
        </module>
        <module name="TCC" id="04706" name2="tmr_tcc_u2213_v5" version="A">
          <instance name="TCC0">
            <register-group name="TCC0" name-in-module="TCC" address-space="base" offset="0x40003400"/>
            <parameters>
              <param name="INSTANCE_ID" value="13"/>
              <param name="SIZE" value="24"/>
              <param name="MASTER_SLAVE_MODE" value="1"/>
              <param name="CC_NUM" value="6"/>
              <param name="OW_NUM" value="6"/>
              <param name="DITHERING" value="1"/>
              <param name="OTMX" value="1"/>
              <param name="DTI" value="1"/>
              <param name="SWAP" value="1"/>
              <param name="PG" value="1"/>
              <param name="DMAC_ID_OVF" value="10"/>
              <param name="DMAC_ID_MC0" value="11"/>
              <param name="DMAC_ID_MC1" value="12"/>
              <param name="DMAC_ID_MC2" value="13"/>
              <param name="DMAC_ID_MC3" value="14"/>
              <param name="DMAC_ID_MC4" value="15"/>
              <param name="DMAC_ID_MC5" value="16"/>
              <param name="GCLK_ID" value="21"/>
            </parameters>
          </instance>
          <instance name="TCC1">
            <register-group name="TCC1" name-in-module="TCC" address-space="base" offset="0x40003800"/>
            <parameters>
              <param name="INSTANCE_ID" value="14"/>
              <param name="SIZE" value="24"/>
              <param name="MASTER_SLAVE_MODE" value="2"/>
              <param name="CC_NUM" value="6"/>
              <param name="OW_NUM" value="6"/>
              <param name="DITHERING" value="1"/>
              <param name="OTMX" value="1"/>
              <param name="DTI" value="1"/>
              <param name="SWAP" value="1"/>
              <param name="PG" value="1"/>
              <param name="DMAC_ID_OVF" value="17"/>
              <param name="DMAC_ID_MC0" value="18"/>
              <param name="DMAC_ID_MC1" value="19"/>
              <param name="DMAC_ID_MC2" value="20"/>
              <param name="DMAC_ID_MC3" value="21"/>
              <param name="DMAC_ID_MC4" value="22"/>
              <param name="DMAC_ID_MC5" value="23"/>
              <param name="GCLK_ID" value="5"/>
            </parameters>
          </instance>
