Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32CX-BZ3_DFP/1.0.157/BZ3/atdf/PIC32CX5109BZ31048.atdf
        <register name="SPIBUF" offset="0x20" rw="RW" size="4" initval="0x00000000" caption="SPI BUFFER register">
          <bitfield name="DATA" caption="FIFO Data bits" mask="0xFFFFFFFF"/>
        </register>
        <register name="SPIBRG" offset="0x30" rw="RW" size="4" initval="0x00000000" caption="SPI Baud rate register">
          <bitfield name="BRG" caption="Baud Rate Divisor bitsseeSection 2.4.1." mask="0x1FFF"/>
        </register>
        <register name="SPITXADD" offset="0x40" rw="RW" size="4" initval="0x00000000" caption="SPI DMA Transmit Address register">
          <bitfield name="TXADD" caption="Transmit Source Address bitsTXADD can constantly be updated to reflect the current transmit address as the transfer progresses" mask="0xFFFF"/>
        </register>
        <register name="SPITXCNT" offset="0x50" rw="RW" size="4" initval="0x00000000" caption="SPI DMA Transmit Count register">
          <bitfield name="TXCNT" caption="Transmit Count bitsThis register indicates the number of transferred data words. As the DMA progresses, TXCNT is constantly decremented to reflect the remaining count yet to be transferred." mask="0xFFFF"/>
        </register>
      </register-group>
      <value-group name="SPICON__GO">
        <value name="0" caption="DMA is not in operation" value="0"/>
        <value name="1" caption="DMA is in operation" value="1"/>
      </value-group>
      <value-group name="SPICON__STXISEL">
        <value name="0" caption="The SPIxTXB is empty and SPIxSR is empty (i.e. all transmit operations are complete)" value="0"/>
        <value name="1" caption="The SPIxTXB is empty" value="1"/>
        <value name="2" caption="The SPIxTXB is at least half empty" value="2"/>
        <value name="3" caption="The SPIxTXB is not full" value="3"/>
      </value-group>
      <value-group name="SPICON__CKP">
        <value name="0" caption="Idle state for clock is a low level; active state is a high level" value="0"/>
        <value name="1" caption="Idle state for clock is a high level; active state is a low level" value="1"/>
      </value-group>
      <value-group name="SPICON__SSCON">
        <value name="0" caption="SS is not controlled by the DMA module" value="0"/>
        <value name="1" caption="SS is asserted for the duration of TXCNT" value="1"/>
      </value-group>
      <value-group name="SPICON__CKE">
        <value name="0" caption="Transmit happens on transition from idle clock state to active clock stat e" value="0"/>
        <value name="1" caption="Transmit happens on transition from active clock state to idle clock state" value="1"/>
      </value-group>
      <value-group name="SPICON__DISSDO">
        <value name="0" caption="SDO pin is controlled by the macro" value="0"/>
        <value name="1" caption="SDO pin is not used by the macro. Pin controlled by PORT function" value="1"/>
      </value-group>
      <value-group name="SPICON__SIDL">
        <value name="0" caption="Continue to operate in CPU Idle mode" value="0"/>
        <value name="1" caption="Halt in CPU Idle mode" value="1"/>
      </value-group>
      <value-group name="SPICON__FRZ">
        <value name="0" caption="Continue macro operation when in Debug mode" value="0"/>
        <value name="1" caption="Break macro operation when in Debug mode" value="1"/>
      </value-group>
      <value-group name="SPICON__ON">
        <value name="0" caption="Turn off and reset macro, disable clocks, disable interrupt event generation, allow SFR modifications." value="0"/>
        <value name="1" caption="Enable macro" value="1"/>
      </value-group>
      <value-group name="SPICON__ENHBUF">
        <value name="0" caption="Enhanced Buffer Mode is disabled" value="0"/>
        <value name="1" caption="Enhanced Buffer Mode is enabled" value="1"/>
      </value-group>
      <value-group name="SPICON__MCLKEN">
        <value name="0" caption="PBCLK is used by the BRG" value="0"/>
        <value name="1" caption="MCLK is used by the BRG" value="1"/>
      </value-group>
      <value-group name="SPICON__MSSEN">
        <value name="0" caption="Slave select SPI support disabled" value="0"/>
        <value name="1" caption="SPI Slave Select support enabled " value="1"/>
      </value-group>
      <value-group name="SPISTAT__SPITBF">
        <value name="0" caption="SPIxTXB not full" value="0"/>
        <value name="1" caption="SPIxTXB is full" value="1"/>
      </value-group>
      <value-group name="SPISTAT__SPITBE">
        <value name="0" caption="SPIxTXB is not empty" value="0"/>
        <value name="1" caption="SPIxTXB is empty" value="1"/>
      </value-group>
      <value-group name="SPISTAT__SRMT">
        <value name="1" caption="There are no current or pending transactions" value="1"/>
      </value-group>
      <value-group name="SPISTAT__SPIBUSY">
        <value name="0" caption="No on-going transactions (at time of read)" value="0"/>
        <value name="1" caption="Macro currently busy with some transactions" value="1"/>
      </value-group>
    </module>
    <module name="DSU" id="05006" name2="icd_dsu_u2410_v4" version="A" caption="Device Service Unit">
      <register-group name="DSU" caption="Device Service Unit">
        <register name="CTRL" offset="0x0" rw="W" size="1" initval="0x00" caption="Control">
          <bitfield name="SWRST" caption="Software Reset" mask="0x1"/>
          <bitfield name="CRC" caption="32-bit Cyclic Redundancy Code" mask="0x4"/>
          <bitfield name="CE" caption="Chip-Erase" mask="0x10"/>
          <bitfield name="ARR" caption="Auxiliary Row Read" mask="0x40"/>
          <bitfield name="SMSA" caption="Start Memory Stream Access" mask="0x80"/>
        </register>
        <register name="STATUSA" offset="0x1" rw="RW" size="1" initval="0x00" caption="Status A">
          <bitfield name="DONE" caption="Done" mask="0x1"/>
          <bitfield name="CRSTEXT" caption="CPU Reset Phase Extension" mask="0x2"/>
          <bitfield name="BERR" caption="Bus Error" mask="0x4"/>
          <bitfield name="FAIL" caption="Failure" mask="0x8"/>
          <bitfield name="PERR" caption="Protection Error" mask="0x10"/>
        </register>
        <register name="STATUSB" offset="0x2" rw="R" size="1" initval="0x00" caption="Status B">
          <bitfield name="PROT" caption="Protected" mask="0x1"/>
          <bitfield name="DBGPRES" caption="Debugger Present" mask="0x2"/>
          <bitfield name="DCCD0" caption="Debug Communication Channel 0 Dirty" mask="0x4"/>
          <bitfield name="DCCD1" caption="Debug Communication Channel 1 Dirty" mask="0x8"/>
          <bitfield name="HPE" caption="Hot-Plugging Enable" mask="0x10"/>
          <bitfield name="CELCK" caption="Chip Erase Locked" mask="0x20"/>
          <bitfield name="TDCCD0" caption="Test Debug Communication Channel 0 Dirty" mask="0x40"/>
          <bitfield name="TDCCD1" caption="Test Debug Communication Channel 1 Dirty" mask="0x80"/>
        </register>
