Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32CX-BZ3_DFP/1.0.157/BZ3/atdf/PIC32CX5109BZ31048.atdf
        <register name="EFUSE_CON" offset="0xC08" rw="RW" size="4" initval="0x00000000" caption="Efuse Configuration Register2">
          <bitfield name="PGM_1BIT" caption="eFuse CTRL to program 1 bit at a time. Valid only when EN_PGM is set" mask="0x1" values="EFUSE_CON__PGM_1BIT"/>
          <bitfield name="PGM_MODE" caption="eFuse Programming Mode Enable bit" mask="0x2" values="EFUSE_CON__PGM_MODE"/>
          <bitfield name="EN_LD" caption="eFuse Word Read Start bit for loading the fuse byte pointed by ADDR field into the holding register" mask="0x20" values="EFUSE_CON__EN_LD"/>
          <bitfield name="EN_LD_ALL1" caption="eFuse Panel Read Start bit for loading into the holding registers" mask="0x40" values="EFUSE_CON__EN_LD_ALL1"/>
          <bitfield name="EN_PGM" caption="eFuse Programming Start bit" mask="0x80" values="EFUSE_CON__EN_PGM"/>
        </register>
      </register-group>
      <value-group name="SECCFG__UUID_LCK">
        <value name="0" caption="Unique ID is not locked" value="0"/>
        <value name="1" caption="Unique ID is locked and cannot be programmed" value="1"/>
        <value name="2" caption="Unique ID is locked and cannot be programmed" value="2"/>
        <value name="3" caption="Unique ID is locked and cannot be programmed" value="3"/>
      </value-group>
      <value-group name="SECCFG__DEBUG_LCK">
        <value name="0" caption="Debug is not locked" value="0"/>
        <value name="1" caption="Debug is locked" value="1"/>
        <value name="2" caption="Debug is locked" value="2"/>
        <value name="3" caption="Debug is locked" value="3"/>
      </value-group>
      <value-group name="SECCFG__ROOT_KEY_LCK">
        <value name="0" caption="Storage root key is not locked" value="0"/>
        <value name="1" caption="Storage root key is locked and cannot be programmed" value="1"/>
        <value name="2" caption="Storage root key is locked and cannot be programmed" value="2"/>
        <value name="3" caption="Storage root key is locked and cannot be programmed" value="3"/>
      </value-group>
      <value-group name="SECCFG__BOOT_KEY_LCK">
        <value name="0" caption="Secure boot key is not locked" value="0"/>
        <value name="1" caption="Secure boot key is locked and cannot be programmed" value="1"/>
        <value name="2" caption="Secure boot key is locked and cannot be programmed" value="2"/>
        <value name="3" caption="Secure boot key is locked and cannot be programmed" value="3"/>
      </value-group>
      <value-group name="SEC_BOOT__SEC_BOOT_REQD">
        <value name="0" caption="S ecure boot code authentication is required" value="0"/>
        <value name="1" caption="S ecure boot code authentication is NOT required" value="1"/>
        <value name="2" caption="S ecure boot code authentication is NOT required" value="2"/>
        <value name="3" caption="S ecure boot code authentication is required" value="3"/>
      </value-group>
      <value-group name="SEC_BOOT__SEC_BOOT_DONE">
        <value name="0" caption="S ecure boot is done" value="0"/>
        <value name="1" caption="S ecure boot is not done" value="1"/>
        <value name="2" caption="S ecure boot is not done" value="2"/>
        <value name="3" caption="S ecure boot is done" value="3"/>
      </value-group>
      <value-group name="EFUSE_CON__PGM_1BIT">
        <value name="0" caption="EFuse controller will program EFUSE_RWDATA.DATA[15:0] to the address in EFUSE_RWDATA.ADDR[11:3]" value="0"/>
        <value name="1" caption="EFuse controller will program EFUSE_RWDATA.DATA[0] to the address in EFUSE_RWDATA.ADDR[11:0]" value="1"/>
      </value-group>
      <value-group name="EFUSE_CON__PGM_MODE">
        <value name="0" caption="EFuse Programming disabled" value="0"/>
        <value name="1" caption="EFuse Programming enabled" value="1"/>
      </value-group>
      <value-group name="EFUSE_CON__EN_LD">
        <value name="0" caption="EFuse Read operation has completed" value="0"/>
        <value name="1" caption="Start eFuse Read operation for specified eFuse word as addressed in EFUSE_RWDATA register" value="1"/>
      </value-group>
      <value-group name="EFUSE_CON__EN_LD_ALL1">
        <value name="0" caption="EFuse Read operation has completed" value="0"/>
        <value name="1" caption="Start eFuse Read operation for entire eFuse panel" value="1"/>
      </value-group>
      <value-group name="EFUSE_CON__EN_PGM">
        <value name="0" caption="EFuse Programming operation has completed" value="0"/>
        <value name="1" caption="Start eFuse Programming operation" value="1"/>
      </value-group>
    </module>
    <module name="SILEX" id="00585" name2="barco_silex_ba457" version="1.0.0" caption="">
      <register-group name="SFR" size="0x405C" caption="">
        <register name="DMA_FETCH_ADDR_LSB" offset="0x0" rw="RW" size="4" initval="0x00000000" caption="">
          <bitfield name="FETCH_ADDR_LSB" caption="" mask="0xFFFFFFFF"/>
        </register>
        <register name="DMA_FETCH_ADDR_MSB" offset="0x4" rw="RW" size="4" initval="0x00000000" caption="">
          <bitfield name="FETCH_ADDR_MSB" caption="" mask="0xFFFFFFFF"/>
        </register>
        <register name="DMA_FETCH_LEN" offset="0x8" rw="RW" size="4" initval="0x00000000" caption="">
          <bitfield name="FETCH_LEN" caption="" mask="0xFFFFFFF"/>
          <bitfield name="FETCH_CSTADDR" caption="" mask="0x10000000"/>
          <bitfield name="FETCH_REALIGN" caption="" mask="0x20000000"/>
          <bitfield name="FETCH_ZPADDING" caption="" mask="0x40000000"/>
        </register>
        <register name="DMA_FETCH_TAG" offset="0xC" rw="RW" size="4" initval="0x00000000" caption="">
          <bitfield name="FETCH_TAG" caption="" mask="0xFFFFFFFF"/>
        </register>
        <register name="DMA_PUSH_ADDR_LSB" offset="0x10" rw="RW" size="4" initval="0x00000000" caption="">
          <bitfield name="PUSH_ADDR_LSB" caption="" mask="0xFFFFFFFF"/>
        </register>
        <register name="DMA_PUSH_ADDR_MSB" offset="0x14" rw="RW" size="4" initval="0x00000000" caption="">
          <bitfield name="PUSH_ADDR_MSB" caption="" mask="0xFFFFFFFF"/>
        </register>
        <register name="DMA_PUSH_LEN" offset="0x18" rw="RW" size="4" initval="0x00000000" caption="">
          <bitfield name="PUSH_LEN" caption="" mask="0xFFFFFFF"/>
          <bitfield name="PUSH_CSTADDR" caption="" mask="0x10000000"/>
          <bitfield name="PUSH_REALIGN" caption="" mask="0x20000000"/>
          <bitfield name="PUSH_DISCARD" caption="" mask="0x40000000"/>
        </register>
        <register name="DMA_INT_EN" offset="0x1C" rw="RW" size="4" initval="0x00000000" caption="">
          <bitfield name="INT_EN" caption="" mask="0xFFFFFFFF"/>
        </register>
