Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32CX-BZ3_DFP/1.0.157/BZ3/atdf/PIC32CX5109BZ31048.atdf
        <register name="ADCCMP1" offset="0xf0" rw="RW" size="4" access-size="4" initval="0x00000000" caption="">
          <bitfield name="ADCMPLO" caption="" mask="0xffff"/>
          <bitfield name="ADCMPHI" caption="" mask="0xffff0000"/>
        </register>
        <register name="ADCCMPEN2" offset="0x100" rw="RW" size="4" access-size="4" initval="0x00000000" caption="">
          <bitfield name="CMPE0" caption="" mask="0x1"/>
          <bitfield name="CMPE1" caption="" mask="0x2"/>
          <bitfield name="CMPE2" caption="" mask="0x4"/>
          <bitfield name="CMPE3" caption="" mask="0x8"/>
          <bitfield name="CMPE4" caption="" mask="0x10"/>
          <bitfield name="CMPE5" caption="" mask="0x20"/>
          <bitfield name="CMPE6" caption="" mask="0x40"/>
          <bitfield name="CMPE7" caption="" mask="0x80"/>
        </register>
        <register name="ADCCMP2" offset="0x110" rw="RW" size="4" access-size="4" initval="0x00000000" caption="">
          <bitfield name="ADCMPLO" caption="" mask="0xffff"/>
          <bitfield name="ADCMPHI" caption="" mask="0xffff0000"/>
        </register>
        <register name="ADCFLTR1" offset="0x1a0" rw="RW" size="4" access-size="4" initval="0x00000000" caption="">
          <bitfield name="FLT_DATA0" caption="" mask="0xffff"/>
          <bitfield name="FLTINID0" caption="" mask="0x1f0000"/>
          <bitfield name="AFIF0" caption="" mask="0x1000000"/>
          <bitfield name="AFIEN0" caption="" mask="0x2000000"/>
          <bitfield name="OVRSAM0" caption="" mask="0x1c000000"/>
          <bitfield name="ADFMODE0" caption="" mask="0x20000000"/>
          <bitfield name="DATA16EN0" caption="" mask="0x40000000"/>
          <bitfield name="AFEN0" caption="" mask="0x80000000"/>
        </register>
        <register name="ADCFLTR2" offset="0x1b0" rw="RW" size="4" access-size="4" initval="0x00000000" caption="">
          <bitfield name="FLT_DATA1" caption="" mask="0xffff"/>
          <bitfield name="FLTINID1" caption="" mask="0x1f0000"/>
          <bitfield name="AFIF1" caption="" mask="0x1000000"/>
          <bitfield name="AFIEN1" caption="" mask="0x2000000"/>
          <bitfield name="OVRSAM1" caption="" mask="0x1c000000"/>
          <bitfield name="ADFMODE1" caption="" mask="0x20000000"/>
          <bitfield name="DATA16EN1" caption="" mask="0x40000000"/>
          <bitfield name="AFEN1" caption="" mask="0x80000000"/>
        </register>
        <register name="ADCTRG1" offset="0x200" rw="RW" size="4" access-size="4" initval="0x00000000" caption="ADC Trigger Source 1 Register">
          <bitfield caption="Trigger Source for Conversion of ADC0 Module Select bits" mask="0x0000001F" name="TRGSRC0" values="ADCTRG1__TRGSRC0"/>
          <bitfield caption="Trigger Source for Conversion of ADC1 Module Select bits" mask="0x00001F00" name="TRGSRC1" values="ADCTRG1__TRGSRC1"/>
          <bitfield caption="Trigger Source for Conversion of ADC2 Module Select bits" mask="0x001F0000" name="TRGSRC2" values="ADCTRG1__TRGSRC2"/>
          <bitfield caption="Trigger Source for Conversion of ADC3 Module Select bits" mask="0x1F000000" name="TRGSRC3" values="ADCTRG1__TRGSRC3"/>
        </register>
        <register name="ADCTRG2" offset="0x210" rw="RW" size="4" access-size="4" initval="0x00000000" caption="ADC Trigger Source 2 Register">
          <bitfield caption="Trigger Source for Conversion of ADC4 Module Select bits" mask="0x0000001F" name="TRGSRC4" values="ADCTRG2__TRGSRC4"/>
          <bitfield caption="Trigger Source for Conversion of ADC5 Module Select bits" mask="0x00001F00" name="TRGSRC5" values="ADCTRG2__TRGSRC5"/>
          <bitfield caption="Trigger Source for Conversion of ADC6 Module Select bits" mask="0x001F0000" name="TRGSRC6" values="ADCTRG2__TRGSRC6"/>
          <bitfield caption="Trigger Source for Conversion of ADC7 Module Select bits" mask="0x1F000000" name="TRGSRC7" values="ADCTRG2__TRGSRC7"/>
        </register>
        <register name="ADCCMPCON1" offset="0x280" rw="RW" size="4" access-size="4" initval="0x00000000" caption="">
          <bitfield name="IELOLO" caption="" mask="0x1"/>
          <bitfield name="IELOHI" caption="" mask="0x2"/>
          <bitfield name="IEHILO" caption="" mask="0x4"/>
          <bitfield name="IEHIHI" caption="" mask="0x8"/>
          <bitfield name="IEBTWN" caption="" mask="0x10"/>
          <bitfield name="DCMPED" caption="" mask="0x20"/>
          <bitfield name="DCMPIEN" caption="" mask="0x40"/>
          <bitfield name="ENDCMP" caption="" mask="0x80"/>
          <bitfield name="CMPINID0" caption="" mask="0x3f00"/>
          <bitfield name="CVD_DATA" caption="" mask="0xffff0000"/>
        </register>
        <register name="ADCCMPCON2" offset="0x290" rw="RW" size="4" access-size="4" initval="0x00000000" caption="">
          <bitfield name="IELOLO" caption="" mask="0x1"/>
          <bitfield name="IELOHI" caption="" mask="0x2"/>
          <bitfield name="IEHILO" caption="" mask="0x4"/>
          <bitfield name="IEHIHI" caption="" mask="0x8"/>
          <bitfield name="IEBTWN" caption="" mask="0x10"/>
          <bitfield name="DCMPED" caption="" mask="0x20"/>
          <bitfield name="DCMPGIEN" caption="" mask="0x40"/>
          <bitfield name="ENDCMP" caption="" mask="0x80"/>
          <bitfield name="AINID" caption="" mask="0x1f00"/>
        </register>
        <register name="ADCBASE" offset="0x300" rw="RW" size="4" access-size="4" initval="0x00000000" caption="">
          <bitfield name="ADCBASE" caption="" mask="0xffff"/>
        </register>
        <register name="ADCCNTB" offset="0x320" rw="RW" size="4" access-size="4" initval="0x00000000" caption="">
          <bitfield name="ADCCNTB" caption="" mask="0xffffffff"/>
        </register>
        <register name="ADCDMAB" offset="0x330" rw="RW" size="4" access-size="4" initval="0x00000000" caption="">
          <bitfield name="ADDMAB" caption="" mask="0xffffffff"/>
        </register>
        <register name="ADCTRGSNS" offset="0x340" rw="RW" size="4" access-size="4" initval="0x00000000" caption="">
          <bitfield name="LVL0" caption="" mask="0x1"/>
          <bitfield name="LVL1" caption="" mask="0x2"/>
          <bitfield name="LVL2" caption="" mask="0x4"/>
          <bitfield name="LVL3" caption="" mask="0x8"/>
          <bitfield name="LVL4" caption="" mask="0x10"/>
          <bitfield name="LVL5" caption="" mask="0x20"/>
          <bitfield name="LVL6" caption="" mask="0x40"/>
          <bitfield name="LVL7" caption="" mask="0x80"/>
        </register>
        <register name="ADCANCON" offset="0x400" rw="RW" size="4" access-size="4" initval="0x00000000" caption="">
          <bitfield name="ANEN0" caption="" mask="0x1"/>
          <bitfield name="ANEN7" caption="" mask="0x80"/>
          <bitfield name="WKRDY0" caption="" mask="0x100"/>
          <bitfield name="WKRDY7" caption="" mask="0x8000"/>
          <bitfield name="WKIEN0" caption="" mask="0x10000"/>
          <bitfield name="WKIEN7" caption="" mask="0x800000"/>
          <bitfield name="WKUPCLKCNT" caption="" mask="0xf000000"/>
        </register>
        <register name="ADC7CFG" offset="0x670" rw="RW" size="4" access-size="4" initval="0x00000000" caption="">
          <bitfield name="ADC7CFG" caption="" mask="0xffffffff"/>
        </register>
