Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32CX-BZ3_DFP/1.0.157/BZ3/atdf/PIC32CX5109BZ31048.atdf
      <value-group name="CCL_LUTCTRL__LUTEO">
        <value name="DISABLE" caption="LUT event output is disabled" value="0"/>
        <value name="ENABLE" caption="LUT event output is enabled" value="1"/>
      </value-group>
    </module>
    <module name="CFG" id="chip_cfg_pb" version="A" caption="">
      <register-group name="CFG" caption="">
        <register name="CFGCON0" offset="0x0" rw="RW" size="4" access-size="4" initval="0x7100000b" caption="">
          <bitfield name="SWOEN" caption="SWO enable on 2-wire debug interface" mask="0x2"/>
          <bitfield name="TROEN" caption="Trace Output Enable" mask="0x4"/>
          <bitfield name="JTAGEN" caption="JTAG Enable" mask="0x8"/>
          <bitfield name="ADCPOVR" caption="ADC Charge Pump Override" mask="0x10"/>
          <bitfield name="ACCMP1_ALTEN" caption="AC CMP1 Alternate Enable" mask="0x40"/>
          <bitfield name="CPENFILT" caption="ADC CP Filter Enable" mask="0x80"/>
          <bitfield name="RTCIN0_ALTEN" caption="RTCIN0 Alternate Enable" mask="0x100"/>
          <bitfield name="RTCOUT_ALTEN" caption="RTCOUT Alternate Enable" mask="0x200"/>
          <bitfield name="PMULOCK" caption="PMU Controller Register LOCK" mask="0x400"/>
          <bitfield name="PGLCOK" caption="Permission Group LOCK" mask="0x800"/>
          <bitfield name="PMDLOCK" caption="Peripheral Module Disable (PMD) LOCK" mask="0x1000"/>
          <bitfield name="IOLOCK" caption="IO LOCK" mask="0x2000"/>
          <bitfield name="CFGCLOCK" caption="Configuration Register Lock" mask="0xc000"/>
          <bitfield name="SMBUSEN0" caption="SMBus Enable for SERCOM0" mask="0x20000"/>
          <bitfield name="SMBUSEN1" caption="SMBus Enable for SERCOM1" mask="0x40000"/>
          <bitfield name="HPLUGDIS" caption="Hot Plugging Disable" mask="0x100000"/>
          <bitfield name="SLRTEN0" caption="SLRT Enable for SERCOM0" mask="0x200000"/>
          <bitfield name="SLRTEN1" caption="SLRT Enable for SERCOM1" mask="0x400000"/>
          <bitfield name="SLRTEN2" caption="SLRT Enable for SERCOM2" mask="0x800000"/>
          <bitfield name="PCM" caption="PCHE I/D Cacheable Mode" mask="0x1000000"/>
          <bitfield name="INT0E" caption="INT0 Enable" mask="0x2000000"/>
          <bitfield name="INT0P" caption="INT0P Polarity" mask="0x4000000"/>
          <bitfield name="FECCCON" caption="Flash ECC Control" mask="0x30000000"/>
          <bitfield name="FRECCDIS" caption="Flex RAM ECC Control" mask="0x40000000"/>
        </register>
        <register name="CFGCON1" offset="0x10" rw="RW" size="4" access-size="4" initval="0x1f00403b" caption="">
          <bitfield name="TRCEN" caption="Trace Enable" mask="0x20"/>
          <bitfield name="ECC_SEL_MEM" caption="ECC row selection bit" mask="0x40"/>
          <bitfield name="ZBTWKSYS" caption="ZBT Subsystem External Wake-up source" mask="0x80"/>
          <bitfield name="CMP0_OE" caption="Analog Comparator-0 Output Enable" mask="0x100"/>
          <bitfield name="CMP1_OE" caption="Analog Comparator-1 Output Enable" mask="0x200"/>
          <bitfield name="SLRCTRL0" caption="I2C Slew Rate Control for SERCOM0" mask="0x800"/>
          <bitfield name="SLRCTRL1" caption="I2C Slew Rate Control for SERCOM1" mask="0x1000"/>
          <bitfield name="SLRCTRL2" caption="I2C Slew Rate Control for SERCOM2" mask="0x2000"/>
          <bitfield name="SMCLR" caption="Selects CRU handling of MCLR Control" mask="0x4000"/>
          <bitfield name="QSCHE_EN" caption="QSPI Address Space Cache Attribute" mask="0x8000"/>
          <bitfield name="QSPI_HSEN" caption="QSPI (Direct) Enable" mask="0x10000"/>
          <bitfield name="SCOM0_HSEN" caption="SERCOM0 (Direct)High Speed Pin Enable" mask="0x20000"/>
          <bitfield name="SCOM1_HSEN" caption="SERCOM1 (Direct)High Speed Pin Enable" mask="0x40000"/>
          <bitfield name="CCL_OE" caption="CCL Pads (via PPS) Output Enable" mask="0x100000"/>
          <bitfield name="I2CDSEL0" caption="I2C Delay Select for SERCOM0" mask="0x200000"/>
          <bitfield name="I2CDSEL1" caption="I2C Delay Select for SERCOM1" mask="0x400000"/>
          <bitfield name="I2CDSEL2" caption="I2C Delay Select for SERCOM2" mask="0x800000"/>
          <bitfield name="WDTPSS" caption="Watchdog Timer Post-scale Select Sleep" mask="0x1f000000"/>
          <bitfield name="QSPIDDRM" caption="QSPI DDR Mode Clock Enable" mask="0x20000000"/>
          <bitfield name="CLKZBREF" caption="External Reference Clock ZB Enable" mask="0x40000000"/>
        </register>
        <register name="CFGCON2" offset="0x20" rw="RW" size="4" access-size="4" initval="0x7f7fff38" caption="">
          <bitfield name="ACMP_CYCLE" caption="AC SIB Comparator Result Wait Cycles" mask="0x7"/>
          <bitfield name="DMTINTV" caption="Dead Man Timer Count Window Interval" mask="0x38"/>
          <bitfield name="PMUTEST_VDD_EN" caption="PMU Test Output or VDD/2 Enable via ADC IE12" mask="0x80"/>
          <bitfield name="POSCMOD" caption="Primary Oscillator Configuration" mask="0x300"/>
          <bitfield name="WDTRMCS" caption="WDT RUN Mode Clock Select" mask="0xc00"/>
          <bitfield name="SOSCSEL" caption="SOSC Selection Configuration" mask="0x1000"/>
          <bitfield name="WAKE2SPD" caption="2-Speed startup enabled in Sleep mode" mask="0x2000"/>
          <bitfield name="CKSWEN" caption="Software Clock Switching Enable" mask="0x4000"/>
          <bitfield name="FSCMEN" caption="Fail-Safe Clock Monitor Enable" mask="0x8000"/>
          <bitfield name="WDTPSR" caption="Watchdog Timer Post-scale Select Run" mask="0x1f0000"/>
          <bitfield name="WDTSPGM" caption="Watchdog Timer Stop during Flash Programming" mask="0x200000"/>
          <bitfield name="WINDIS" caption="Windowed Watchdog Timer Disable" mask="0x400000"/>
          <bitfield name="WDTEN" caption="Watchdog Timer Enable" mask="0x800000"/>
          <bitfield name="WDTWINSZ" caption="Watchdog Timer Window Size" mask="0x3000000"/>
          <bitfield name="DMTCNT" caption="Dead Man Timer Count Select" mask="0x7c000000"/>
          <bitfield name="DMTEN" caption="Dead Man Timer Enable" mask="0x80000000"/>
        </register>
        <register name="CFGCON4" offset="0x40" rw="RW" size="4" access-size="4" initval="0x840e4000" caption="">
          <bitfield name="SOSC_CFG" caption="SOSC Configuration" mask="0xff"/>
          <bitfield name="RTCEVENT_SEL" caption="RTC Event Selection" mask="0x300"/>
          <bitfield name="RTCEVENT_EN" caption="Pad Output Enable for MCHP legacy RTC event output" mask="0x400"/>
          <bitfield name="VBKP_1KCSEL" caption="VDDBUKPCORE LPCLK Clock Selection" mask="0x800"/>
          <bitfield name="VBKP_32KCSEL" caption="VDDBUKPCORE 32KHz clock source selection" mask="0x3000"/>
          <bitfield name="VBKP_DIVSEL" caption="VDDBUKPCORE LPCLK Clock Divider Selection" mask="0x4000"/>
          <bitfield name="LPCLK_MOD" caption="LPCLK modifier in counter/delay mode" mask="0x8000"/>
          <bitfield name="RTCEVTYPE" caption="RTC Event Type" mask="0x10000"/>
          <bitfield name="CPEN_DLY" caption="Charge-pump ready digital delay" mask="0xe0000"/>
          <bitfield name="DSZPBOREN" caption="Deep Sleep Zero-Power BOR Enable" mask="0x100000"/>
          <bitfield name="DSWDTPS" caption="Deep Sleep Watchdog Timer Postscale Select" mask="0x3e00000"/>
          <bitfield name="DSWDTOSC" caption="Deep Sleep Watchdog Timer Reference Clock Select" mask="0x4000000"/>
          <bitfield name="DSWDTEN" caption="Deep Sleep Watchdog Timer Enable" mask="0x8000000"/>
          <bitfield name="DSEN" caption="Deep Sleep Bit Enable" mask="0x10000000"/>
          <bitfield name="UVREGROVR" caption="ULPVREG Retention Mode Override" mask="0x20000000"/>
          <bitfield name="LPOSCEN" caption="Low Power (Secondary) Oscillator Enable" mask="0x40000000"/>
          <bitfield name="RTCNTM_CSEL" caption="RTC Counter Mode Clock Select" mask="0x80000000"/>
        </register>
