Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32CX-BZ3_DFP/1.0.157/BZ3/atdf/PIC32CX5109BZ31048.atdf
      <value-group caption="Clock Switch Slewing Active Status Bit - Read-Only" name="SLEWCON__BUSY">
        <value caption="Clock Switch has reached its final value" name="FINAL" value="0x0"/>
        <value caption="Clock frequency is being actively Slewed" name="BUSY" value="0x1"/>
      </value-group>
      <value-group caption="Clock slew enable for switching down to slower clocks" name="SLEWCON__DNEN">
        <value caption="Clock Slewing disabled" name="DISABLED" value="0x0"/>
        <value caption="Clock Slewing enabled on a clock switch" name="ENABLED" value="0x1"/>
      </value-group>
      <value-group caption="Clock slew enable for switching up to faster clocks" name="SLEWCON__UPEN">
        <value caption="Clock Slewing disabled" name="DISABLED" value="0x0"/>
        <value caption="Clock Slewing enabled on a clock switch OR exit from SLEEP" name="ENABLED" value="0x1"/>
      </value-group>
      <value-group caption="Divisor steps used when doing slewed clock switches" name="SLEWCON__SLWDIV">
        <value caption="No Divisor used" name="NONE" value="0x0"/>
        <value caption="Divide by 2, then no divisor" name="2" value="0x1"/>
        <value caption="Divide by 4, then by 2, then no divisor" name="4to2" value="0x2"/>
        <value caption="Divide by 8, then by 4, then by 2, then no divisor" name="8to2" value="0x3"/>
        <value caption="Divide by 16, then by 8, then by 4, then by 2, then no divisor" name="16to2" value="0x4"/>
        <value caption="Divide by 32, then by 16, then by 8, then by 4, then by 2, then no divisor" name="32to2" value="0x5"/>
        <value caption="Divide by 64, then by 32, then by 16, then by 8, then by 4, then by 2, then no divisor" name="64to2" value="0x6"/>
        <value caption="Divide by 128, then by 64, then by 32, then by 16, then by 8, then by 4, then by 2, then no divisor" name="128to2" value="0x7"/>
      </value-group>
      <value-group caption="PBx Peripheral Clock Divisor Control value" name="SLEWCON__SYSDIV">
        <value caption="Divide by 1- sys_clk_out same frequency as sys_clk source - Default" name="DIV1" value="0x0"/>
        <value caption="Divide by 2- sys_clk_out is 1/2 of sys_clk source" name="DIV2" value="0x1"/>
        <value caption="Divide by 3- sys_clk_out is 1/3 of sys_clk source" name="DIV3" value="0x2"/>
        <value caption="Divide by 4- sys_clk_out is 1/4 of sys_clk source" name="DIV4" value="0x3"/>
        <value caption="Divide by 5- sys_clk_out is 1/5 of sys_clk source" name="DIV5" value="0x4"/>
        <value caption="Divide by 6- sys_clk_out is 1/6 of sys_clk source" name="DIV6" value="0x5"/>
        <value caption="Divide by 7- sys_clk_out is 1/7 of sys_clk source" name="DIV7" value="0x6"/>
        <value caption="Divide by 8- sys_clk_out is 1/8 of sys_clk source" name="DIV8" value="0x7"/>
        <value caption="Divide by 9- sys_clk_out is 1/9 of sys_clk source" name="DIV9" value="0x8"/>
        <value caption="Divide by 10- sys_clk_out is 1/10 of sys_clk source" name="DIV10" value="0x9"/>
        <value caption="Divide by 11- sys_clk_out is 1/11 of sys_clk source" name="DIV11" value="0xa"/>
        <value caption="Divide by 12- sys_clk_out is 1/12 of sys_clk source" name="DIV12" value="0xb"/>
        <value caption="Divide by 13- sys_clk_out is 1/13 of sys_clk source" name="DIV13" value="0xc"/>
        <value caption="Divide by 14- sys_clk_out is 1/14 of sys_clk source" name="DIV14" value="0xd"/>
        <value caption="Divide by 15- sys_clk_out is 1/15 of sys_clk source" name="DIV15" value="0xe"/>
        <value caption="Divide by 16- sys_clk_out is 1/16 of sys_clk source" name="DIV16" value="0xf"/>
      </value-group>
      <value-group caption="Number of clocks generated at each slew step for a clock switch" name="SLEWCON__SLWDLY">
        <value caption="1 clock will be generated at each slew step" name="1" value="0x0"/>
        <value caption="2 clocks will be generated at each slew step" name="2" value="0x1"/>
        <value caption="3 clocks will be generated at each slew step" name="3" value="0x2"/>
        <value caption="4 clocks will be generated at each slew step" name="4" value="0x3"/>
        <value caption="5 clocks will be generated at each slew step" name="5" value="0x4"/>
        <value caption="6 clocks will be generated at each slew step" name="6" value="0x5"/>
        <value caption="7 clocks will be generated at each slew step" name="7" value="0x6"/>
        <value caption="8 clocks will be generated at each slew step" name="8" value="0x7"/>
        <value caption="9 clocks will be generated at each slew step" name="9" value="0x8"/>
        <value caption="10 clocks will be generated at each slew step" name="10" value="0x9"/>
        <value caption="11 clocks will be generated at each slew step" name="11" value="0xa"/>
        <value caption="12 clocks will be generated at each slew step" name="12" value="0xb"/>
        <value caption="13 clocks will be generated at each slew step" name="13" value="0xc"/>
        <value caption="14 clocks will be generated at each slew step" name="14" value="0xd"/>
        <value caption="15 clocks will be generated at each slew step" name="15" value="0xe"/>
        <value caption="16 clocks will be generated at each slew step" name="16" value="0xf"/>
      </value-group>
      <value-group caption="FRC Ready Status value" name="CLKSTAT__FRCRDY">
        <value caption="FRC is not stable and not ready" name="NOTRDY" value="0x0"/>
        <value caption="FRC is stable and ready" name="RDY" value="0x1"/>
      </value-group>
      <value-group caption="System PLL1 Ready Status value" name="CLKSTAT__SPLL1RDY">
        <value caption="SPLL1 Primary Output is not stable and not ready" name="NOTRDY" value="0x0"/>
        <value caption="SPLL1 Primary Output is stable and ready" name="RDY" value="0x1"/>
      </value-group>
      <value-group caption="Primary Oscillator Ready Status value" name="CLKSTAT__POSCRDY">
        <value caption="POSC is not stable and not ready" name="NOTRDY" value="0x0"/>
        <value caption="POSC is stable and ready" name="RDY" value="0x1"/>
      </value-group>
      <value-group caption="SOSC Ready Status value" name="CLKSTAT__SOSCRDY">
        <value caption="SOSC is not stable and not ready" name="NOTRDY" value="0x0"/>
        <value caption="SOSC is stable and ready" name="RDY" value="0x1"/>
      </value-group>
      <value-group caption="LPRC Ready Status value" name="CLKSTAT__LPRCRDY">
        <value caption="LPRC is not stable and not ready" name="NOTRDY" value="0x0"/>
        <value caption="LPRC is stable and ready" name="RDY" value="0x1"/>
      </value-group>
