Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32CX-BZ3_DFP/1.0.157/BZ3/atdf/PIC32CX5109BZ31048.atdf
      <value-group name="DMAC_PRICTRL0__QOS2">
        <value name="REGULAR" caption="Regular delivery" value="0"/>
        <value name="SHORTAGE" caption="Bandwidth shortage" value="1"/>
        <value name="SENSITIVE" caption="Latency sensitive" value="2"/>
        <value name="CRITICAL" caption="Latency critical" value="3"/>
      </value-group>
      <value-group name="DMAC_PRICTRL0__QOS3">
        <value name="REGULAR" caption="Regular delivery" value="0"/>
        <value name="SHORTAGE" caption="Bandwidth shortage" value="1"/>
        <value name="SENSITIVE" caption="Latency sensitive" value="2"/>
        <value name="CRITICAL" caption="Latency critical" value="3"/>
      </value-group>
      <value-group name="DMAC_CHCTRLA__BURSTLEN">
        <value name="SINGLE" caption="Single-beat burst length" value="0"/>
        <value name="2BEAT" caption="2-beats burst length" value="1"/>
        <value name="3BEAT" caption="3-beats burst length" value="2"/>
        <value name="4BEAT" caption="4-beats burst length" value="3"/>
        <value name="5BEAT" caption="5-beats burst length" value="4"/>
        <value name="6BEAT" caption="6-beats burst length" value="5"/>
        <value name="7BEAT" caption="7-beats burst length" value="6"/>
        <value name="8BEAT" caption="8-beats burst length" value="7"/>
        <value name="9BEAT" caption="9-beats burst length" value="8"/>
        <value name="10BEAT" caption="10-beats burst length" value="9"/>
        <value name="11BEAT" caption="11-beats burst length" value="10"/>
        <value name="12BEAT" caption="12-beats burst length" value="11"/>
        <value name="13BEAT" caption="13-beats burst length" value="12"/>
        <value name="14BEAT" caption="14-beats burst length" value="13"/>
        <value name="15BEAT" caption="15-beats burst length" value="14"/>
        <value name="16BEAT" caption="16-beats burst length" value="15"/>
      </value-group>
      <value-group name="DMAC_CHCTRLA__THRESHOLD">
        <value name="1BEAT" caption="Destination write starts after each beat source address read" value="0"/>
        <value name="2BEATS" caption="Destination write starts after 2-beats source address read" value="1"/>
        <value name="4BEATS" caption="Destination write starts after 4-beats source address read" value="2"/>
        <value name="8BEATS" caption="Destination write starts after 8-beats source address read" value="3"/>
      </value-group>
      <value-group name="DMAC_CHCTRLA__TRIGACT">
        <value name="BLOCK" caption="One trigger required for each block transfer" value="0"/>
        <value name="BURST" caption="One trigger required for each burst transfer" value="2"/>
        <value name="TRANSACTION" caption="One trigger required for each transaction" value="3"/>
      </value-group>
      <value-group name="DMAC_CHCTRLA__TRIGSRC">
        <value name="DISABLE" caption="Only software/event triggers" value="0"/>
      </value-group>
      <value-group name="DMAC_CHCTRLB__CMD">
        <value name="NOACT" caption="No action" value="0x0"/>
        <value name="SUSPEND" caption="Channel suspend operation" value="0x1"/>
        <value name="RESUME" caption="Channel resume operation" value="0x2"/>
      </value-group>
      <value-group name="DMAC_CHPRILVL__PRILVL">
        <value name="LVL0" caption="Channel Priority Level 0 (Lowest Level)" value="0"/>
        <value name="LVL1" caption="Channel Priority Level 1" value="1"/>
        <value name="LVL2" caption="Channel Priority Level 2" value="2"/>
        <value name="LVL3" caption="Channel Priority Level 3 (Highest Level)" value="3"/>
      </value-group>
      <value-group name="DMAC_CHEVCTRL__EVACT">
        <value name="NOACT" caption="No action" value="0"/>
        <value name="TRIG" caption="Transfer and periodic transfer trigger" value="1"/>
        <value name="CTRIG" caption="Conditional transfer trigger" value="2"/>
        <value name="CBLOCK" caption="Conditional block transfer" value="3"/>
        <value name="SUSPEND" caption="Channel suspend operation" value="4"/>
        <value name="RESUME" caption="Channel resume operation" value="5"/>
        <value name="SSKIP" caption="Skip next block suspend action" value="6"/>
        <value name="INCPRI" caption="Increase priority" value="7"/>
      </value-group>
      <value-group name="DMAC_CHEVCTRL__EVOMODE">
        <value name="DEFAULT" caption="Block event output selection. Refer to BTCTRL.EVOSEL for available selections." value="0"/>
        <value name="TRIGACT" caption="Ongoing trigger action" value="1"/>
      </value-group>
    </module>
    <module name="DMT" id="01520" version="1.0" caption="Dead Man Timer">
      <register-group name="DMT" caption="Dead Man Timer">
        <register name="DMTCON" offset="0x0" rw="RW" size="4" access-size="4" initval="0x00000000" caption="">
          <bitfield name="ON" caption="" mask="0x8000"/>
        </register>
        <register name="DMTPRECLR" offset="0x10" rw="RW" size="4" access-size="4" initval="0x00000000" caption="">
          <bitfield name="STEP1" caption="" mask="0xff00"/>
        </register>
        <register name="DMTCLR" offset="0x20" rw="RW" size="4" access-size="4" initval="0x00000000" caption="">
          <bitfield name="STEP2" caption="" mask="0xff"/>
        </register>
        <register name="DMTSTAT" offset="0x30" rw="RW" size="4" access-size="4" initval="0x00000000" caption="">
          <bitfield name="WINOPN" caption="" mask="0x1"/>
          <bitfield name="DMTEVENT" caption="" mask="0x20"/>
          <bitfield name="BAD2" caption="" mask="0x40"/>
          <bitfield name="BAD1" caption="" mask="0x80"/>
        </register>
        <register name="DMTCNT" offset="0x40" rw="R" size="4" access-size="4" initval="0x00000000" caption="">
          <bitfield name="COUNTER" caption="" mask="0xffffffff"/>
        </register>
        <register name="DMTHOLDREG" offset="0x50" rw="R" size="4" access-size="4" initval="0x00000000" caption="">
          <bitfield name="UPRCNT" caption="" mask="0xffff"/>
        </register>
        <register name="DMTPSCNT" offset="0x60" rw="R" size="4" access-size="4" initval="0x00000000" caption="">
          <bitfield name="PSCNT" caption="" mask="0xffffffff"/>
        </register>
        <register name="DMTPSINTV" offset="0x70" rw="R" size="4" access-size="4" initval="0x00000000" caption="">
          <bitfield name="PSINTV" caption="" mask="0xffffffff"/>
        </register>
