Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32CX-BZ3_DFP/1.0.157/BZ3/atdf/PIC32CX5109BZ31048.atdf
        <register name="RPB5G2R" offset="0x2b4" rw="RW" size="4" access-size="4" initval="0x00000000" caption="">
          <bitfield name="RPB5G2R" caption="RPB5/G2" mask="0x1f" values="RPB5G2_PINS"/>
        </register>
        <register name="RPB5G1R" offset="0x2b8" rw="RW" size="4" access-size="4" initval="0x00000000" caption="">
          <bitfield name="RPB5G1R" caption="RPB5/G1" mask="0x1f" values="RPB5G1_PINS"/>
        </register>
        <register name="RPB6G3R" offset="0x2bc" rw="RW" size="4" access-size="4" initval="0x00000000" caption="">
          <bitfield name="RPB6G3R" caption="RPB6/G3" mask="0x1f" values="RPB6G3_PINS"/>
        </register>
        <register name="RPB6G1R" offset="0x2c0" rw="RW" size="4" access-size="4" initval="0x00000000" caption="">
          <bitfield name="RPB6G1R" caption="RPB6/G1" mask="0x1f" values="RPB6G1_PINS"/>
        </register>
        <register name="RPB7G1R" offset="0x2c4" rw="RW" size="4" access-size="4" initval="0x00000000" caption="">
          <bitfield name="RPB7G1R" caption="RPB7/G1" mask="0x1f" values="RPB7G1_PINS"/>
        </register>
        <register name="RPB7G4R" offset="0x2c8" rw="RW" size="4" access-size="4" initval="0x00000000" caption="">
          <bitfield name="RPB7G4R" caption="RPB7/G4" mask="0x1f" values="RPB7G4_PINS"/>
        </register>
        <register name="RPB8G1R" offset="0x2cc" rw="RW" size="4" access-size="4" initval="0x00000000" caption="">
          <bitfield name="RPB8G1R" caption="RPB8/G1" mask="0x1f" values="RPB8G1_PINS"/>
        </register>
        <register name="RPB8G2R" offset="0x2d0" rw="RW" size="4" access-size="4" initval="0x00000000" caption="">
          <bitfield name="RPB8G2R" caption="RPB8/G2" mask="0x1f" values="RPB8G2_PINS"/>
        </register>
        <register name="RPB9G1R" offset="0x2d4" rw="RW" size="4" access-size="4" initval="0x00000000" caption="">
          <bitfield name="RPB9G1R" caption="RPB9/G1" mask="0x1f" values="RPB9G1_PINS"/>
        </register>
        <register name="RPB9G3R" offset="0x2d8" rw="RW" size="4" access-size="4" initval="0x00000000" caption="">
          <bitfield name="RPB9G3R" caption="RPB9/G3" mask="0x1f" values="RPB9G3_PINS"/>
        </register>
        <register name="RPB10G3R" offset="0x2dc" rw="RW" size="4" access-size="4" initval="0x00000000" caption="">
          <bitfield name="RPB10G3R" caption="RPB10/G3" mask="0x1f" values="RPB10G3_PINS"/>
        </register>
        <register name="RPB10G4R" offset="0x2e0" rw="RW" size="4" access-size="4" initval="0x00000000" caption="">
          <bitfield name="RPB10G4R" caption="RPB10/G4" mask="0x1f" values="RPB10G4_PINS"/>
        </register>
        <register name="RPB11G4R" offset="0x2e8" rw="RW" size="4" access-size="4" initval="0x00000000" caption="">
          <bitfield name="RPB11G4R" caption="RPB11/G4" mask="0x1f" values="RPB11G4_PINS"/>
        </register>
        <register name="RPB12G2R" offset="0x2f0" rw="RW" size="4" access-size="4" initval="0x00000000" caption="">
          <bitfield name="RPB12G2R" caption="RPB12/G2" mask="0x1f" values="RPB12G2_PINS"/>
        </register>
        <register name="RPB13G2R" offset="0x2f4" rw="RW" size="4" access-size="4" initval="0x00000000" caption="">
          <bitfield name="RPB13G2R" caption="RPB13/G2" mask="0x1f" values="RPB13G2_PINS"/>
        </register>
        <register name="RPB13G3R" offset="0x2f8" rw="RW" size="4" access-size="4" initval="0x00000000" caption="">
          <bitfield name="RPB13G3R" caption="RPB13/G3" mask="0x1f" values="RPB13G3_PINS"/>
        </register>
      </register-group>
      <!-- INPUT pin group values -->
      <value-group name="EXTINT0_PINS" caption="Group1">
        <value name="RPA9" caption="RPA9" value="15"/>
        <value name="RPA3" caption="RPA3" value="1"/>
        <value name="RPA7" caption="RPA7" value="2"/>
        <value name="RPA11" caption="RPA11" value="3"/>
        <value name="RPB0" caption="RPB0" value="4"/>
        <value name="RPB4" caption="RPB4" value="5"/>
        <value name="RPB8" caption="RPB8" value="6"/>
        <value name="RPB12" caption="RPB12" value="7"/>
        <value name="RPA2" caption="RPA2" value="8"/>
        <value name="RPA6" caption="RPA6" value="9"/>
        <value name="RPA10" caption="RPA10" value="10"/>
        <value name="RPA14" caption="RPA14" value="11"/>
        <value name="RPB3" caption="RPB3" value="12"/>
        <value name="RPB7" caption="RPB7" value="13"/>
        <value name="RPB11" caption="RPB11" value="14"/>
        <value name="OFF" caption="OFF" value="0"/>
      </value-group>
      <value-group name="EXTINT1_PINS" caption="Group2">
        <value name="RPA0" caption="RPA0" value="15"/>
        <value name="RPA4" caption="RPA4" value="1"/>
        <value name="RPA8" caption="RPA8" value="2"/>
        <value name="RPA12" caption="RPA12" value="3"/>
        <value name="RPB1" caption="RPB1" value="4"/>
        <value name="RPB5" caption="RPB5" value="5"/>
        <value name="RPB9" caption="RPB9" value="6"/>
        <value name="RPB13" caption="RPB13" value="7"/>
        <value name="RPA3" caption="RPA3" value="8"/>
        <value name="RPA7" caption="RPA7" value="9"/>
        <value name="RPA11" caption="RPA11" value="10"/>
        <value name="RPB0" caption="RPB0" value="11"/>
        <value name="RPB4" caption="RPB4" value="12"/>
        <value name="RPB8" caption="RPB8" value="13"/>
        <value name="RPB12" caption="RPB12" value="14"/>
        <value name="OFF" caption="OFF" value="0"/>
      </value-group>
      <value-group name="EXTINT2_PINS" caption="Group3">
        <value name="RPA1" caption="RPA1" value="15"/>
        <value name="RPA5" caption="RPA5" value="1"/>
        <value name="RPA9" caption="RPA9" value="2"/>
        <value name="RPA13" caption="RPA13" value="3"/>
        <value name="RPB2" caption="RPB2" value="4"/>
        <value name="RPB6" caption="RPB6" value="5"/>
        <value name="RPB10" caption="RPB10" value="6"/>
        <value name="RPA0" caption="RPA0" value="7"/>
        <value name="RPA4" caption="RPA4" value="8"/>
        <value name="RPA8" caption="RPA8" value="9"/>
        <value name="RPA12" caption="RPA12" value="10"/>
        <value name="RPB1" caption="RPB1" value="11"/>
        <value name="RPB5" caption="RPB5" value="12"/>
        <value name="RPB9" caption="RPB9" value="13"/>
        <value name="RPB13" caption="RPB13" value="14"/>
        <value name="OFF" caption="OFF" value="0"/>
      </value-group>
