Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32CX-BZ3_DFP/1.0.157/BZ3/atdf/PIC32CX5109BZ31048.atdf
        <register name="SUBSYS_STATUS_REG1" offset="0x24" rw="R" size="4" access-size="4" initval="0x00000000" caption="SUBSYS_STATUS_REG1">
          <bitfield name="pllc_ready_cnt_expire_raw" caption="pllc_ready_cnt_expire_raw" mask="0x100"/>
          <bitfield name="pll_lock_fifo_empty" caption="XTAL_ready" mask="0x80"/>
          <bitfield name="clk_mux_sel" caption="clk_mux_sel0" mask="0x60"/>
          <bitfield name="clk_lp_ready" caption="clk_lp_ready" mask="0x10"/>
          <bitfield name="PLL_locked" caption="PLL_locked" mask="0x8"/>
          <bitfield name="XTAL_ready" caption="XTAL_ready" mask="0x4"/>
          <bitfield name="pll_lock_out" caption="pll_lock_out" mask="0x2"/>
          <bitfield name="xtal_ready_out" caption="xtal_ready_out" mask="0x1"/>
        </register>
        <register name="SUBSYS_STATUS_REG2" offset="0x28" rw="R" size="4" access-size="4" initval="0x00000000" caption="SUBSYS_STATUS_REG2">
          <bitfield name="PART_NUM" caption="PART_NUM" mask="0xFF00"/>
          <bitfield name="VERSION_NUM" caption="VERSION_NUM" mask="0xFF"/>
        </register>
      </register-group>
    </module>
    <module name="ZIGBEE" id="04998" name2="zb_mac_v3" version="A" caption="ZigBee MAC DOS">
      <register-group name="ZIGBEE" caption="Zero Radio Registers"/>
    </module>
  </modules>
  <pinouts>
    <pinout name="QFN48" caption="QFN48">
      <pin position="1" pad="VPMU_VDD"/>
      <pin position="2" pad="PA0"/>
      <pin position="3" pad="PA1"/>
      <pin position="4" pad="PA2"/>
      <pin position="5" pad="PA5"/>
      <pin position="6" pad="VDD"/>
      <pin position="7" pad="PA6"/>
      <pin position="8" pad="PA7"/>
      <pin position="9" pad="PA8"/>
      <pin position="10" pad="PA9"/>
      <pin position="11" pad="PA10"/>
      <pin position="12" pad="PB12"/>
      <pin position="13" pad="PB13"/>
      <pin position="14" pad="PB9"/>
      <pin position="15" pad="PB8"/>
      <pin position="16" pad="PA4"/>
      <pin position="17" pad="PA13"/>
      <pin position="18" pad="PA14"/>
      <pin position="19" pad="NMCLR"/>
      <pin position="20" pad="VDDCORE"/>
      <pin position="21" pad="CLDO_IN"/>
      <pin position="22" pad="XO_N"/>
      <pin position="23" pad="XO_P"/>
      <pin position="24" pad="VDD_PLL"/>
      <pin position="25" pad="CLDO_OUT"/>
      <pin position="26" pad="RFLDO_OUT"/>
      <pin position="27" pad="BUCK_CLDO"/>
      <pin position="28" pad="BUCK_PA"/>
      <pin position="29" pad="RF_IO"/>
      <pin position="31" pad="PB0"/>
      <pin position="32" pad="PB1"/>
      <pin position="33" pad="PB2"/>
      <pin position="34" pad="PB3"/>
      <pin position="35" pad="PB4"/>
      <pin position="36" pad="AVDD"/>
      <pin position="37" pad="PB5"/>
      <pin position="38" pad="PB6"/>
      <pin position="39" pad="PB7"/>
      <pin position="40" pad="PA3"/>
      <pin position="41" pad="VDD"/>
      <pin position="42" pad="PB10"/>
      <pin position="43" pad="PB11"/>
      <pin position="44" pad="PA11"/>
      <pin position="45" pad="PA12"/>
      <pin position="46" pad="PMU_MLDO"/>
      <pin position="47" pad="VPMU_VDD"/>
      <pin position="48" pad="PMU_BK"/>
    </pinout>
  </pinouts>
</avr-tools-device-file>
